
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    
        
        <link rel="stylesheet" href="gitbook/ebook.css">
        
    

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/ebook.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    </head>
    <body>
        
<div class="page">
    
        <h1 class="book-chapter book-chapter-2">前言</h1>
        <div class="section">
            <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>Python &#x53EF;&#x80FD;&#x662F;&#x6781;&#x5C11;&#x6570;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x517C;&#x987E;&#x7B80;&#x5355;&#x4E0E;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5BF9;&#x4E8E;&#x65B0;&#x624B;&#x6216;&#x662F;&#x884C;&#x5BB6;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x90FD;&#x88E8;&#x76CA;&#x9887;&#x6DF1;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x91C7;&#x7528; Python &#x7F16;&#x7A0B;&#x5145;&#x6EE1;&#x4E86;&#x4E50;&#x8DA3;&#x3002;&#x672C;&#x4E66;&#x65E8;&#x5728;&#x4E8E;&#x5E2E;&#x52A9;&#x4F60;&#x5B66;&#x4E60;&#x8FD9;&#x4E00;&#x7F8E;&#x5999;&#x7684;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x5411;&#x4F60;&#x5C55;&#x73B0;&#x5982;&#x4F55;&#x5FEB;&#x901F;&#x4E14;&#x6BEB;&#x4E0D;&#x8D39;&#x529B;&#x5730;&#x5B8C;&#x6210;&#x8BF8;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x53EF;&#x8BF4;&#x662F;&#x201C;&#x52A9;&#x4F60;&#x89E3;&#x51B3;&#x7F16;&#x7A0B;&#x95EE;&#x9898;&#x7684;&#x6297;&#x6BD2;&#x8840;&#x6E05;&#x201D;&#x3002;</p>
<h2 id="&#x672C;&#x4E66;&#x662F;&#x4E3A;&#x8C01;&#x800C;&#x64B0;">&#x672C;&#x4E66;&#x662F;&#x4E3A;&#x8C01;&#x800C;&#x64B0;</h2>
<p>&#x672C;&#x4E66;&#x5C06;&#x4EE5;&#x6307;&#x5357;&#x6216;&#x6559;&#x7A0B;&#x7684;&#x5F62;&#x5F0F;&#x5411;&#x4F60;&#x4ECB;&#x7ECD; Python &#x8FD9;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5B83;&#x4EE5;&#x65B0;&#x624B;&#x4E3A;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x3002;&#x540C;&#x65F6;&#x672C;&#x4E66;&#x4E5F;&#x5BF9;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x7535;&#x8111;&#x7684;&#x6240;&#x6709;&#x4E86;&#x89E3;&#x4EC5;&#x6B62;&#x6B65;&#x4E8E;&#x5982;&#x4F55;&#x4FDD;&#x5B58;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x672C;&#x4E66;&#x7684;&#x76EE;&#x6807;&#x4FBF;&#x662F;&#x534F;&#x52A9;&#x4F60;&#x901A;&#x8FC7;&#x672C;&#x4E66;&#x5B66;&#x4E60; Python&#x3002;&#x5982;&#x679C;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x4F60;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#xFF0C;&#x4F60;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x672C;&#x4E66;&#x6765;&#x5B66;&#x4E60; Python&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x6709;&#x8FC7;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#xFF0C;&#x4F60;&#x6216;&#x8BB8;&#x4F1A;&#x5BF9; Python &#x4E0E;&#x5176;&#x5B83;&#x4F60;&#x6240;&#x559C;&#x7231;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x95F4;&#x6709;&#x4F55;&#x533A;&#x522B;&#x62B1;&#x6709;&#x5174;&#x8DA3;&#x2014;&#x2014;&#x800C;&#x6211;&#x5C06;&#x4F1A;&#x4F60;&#x5C55;&#x73B0;&#x8BB8;&#x591A;&#x8FD9;&#x79CD;&#x533A;&#x522B;&#x3002;&#x987A;&#x4FBF;&#x63D0;&#x9192;&#x4F60;&#x4E00;&#x4E0B;&#xFF0C;Python &#x5C06;&#x4F1A;&#x5F88;&#x5FEB;&#x6210;&#x4E3A;&#x4F60;&#x6700;&#x559C;&#x6B22;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF01;</p>
<h2 id="&#x5B98;&#x65B9;&#x7F51;&#x7AD9;">&#x5B98;&#x65B9;&#x7F51;&#x7AD9;</h2>
<p>&#x672C;&#x4E66;&#x82F1;&#x6587;&#x539F;&#x7248;&#x7684;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x662F; <a href="http://python.swaroopch.com/" target="_blank">http://python.swaroopch.com/</a>  &#xFF0C;&#x5728;&#x6B64;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x7EBF;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x7684;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#xFF0C;&#x4E0B;&#x8F7D;&#x672C;&#x4E66;&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#xFF0C;<a href="http://www.swaroopch.com/buybook/" target="_blank">&#x8D2D;&#x4E70;&#x672C;&#x4E66;&#x7684;&#x5B9E;&#x4F53;&#x7248;</a>&#xFF0C;&#x6216;&#x662F;&#x5411;&#x6211;&#x63D0;&#x4EA4;&#x53CD;&#x9988;&#x3002;</p>
<p>&#x4F60;&#x73B0;&#x5728;&#x9605;&#x8BFB;&#x7684;&#x8FD9;&#x4E00;&#x7B80;&#x4F53;&#x4E2D;&#x6587;&#x7248;&#x7684;&#x520A;&#x8F7D;&#x7F51;&#x7AD9;&#x662F; <a href="https://bop.mol.uno" target="_blank">https://bop.mol.uno</a>  &#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x6B64;&#x5728;&#x7EBF;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x7684;&#x7B80;&#x4F53;&#x4E2D;&#x6587;&#x7248;&#xFF0C;&#x5E76;&#x4E0B;&#x8F7D;&#x6700;&#x65B0;&#x7248;&#x672C;&#x3002;</p>
<h2 id="&#x503C;&#x5F97;&#x601D;&#x8003;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;">&#x503C;&#x5F97;&#x601D;&#x8003;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;</h2>
<blockquote>
<p>&#x6784;&#x5EFA;&#x4E00;&#x9879;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;&#x4E00;&#x79CD;&#x662F;&#x5C06;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5F97;&#x8DB3;&#x591F;&#x7B80;&#x5355;&#x4EE5;&#x81F3;&#x4E8E;&#x660E;&#x663E;&#x627E;&#x4E0D;&#x5230;&#x7F3A;&#x9677;&#xFF1B;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5F97;&#x8DB3;&#x591F;&#x590D;&#x6742;&#x4EE5;&#x81F3;&#x4E8E;&#x627E;&#x4E0D;&#x5230;&#x660E;&#x663E;&#x7684;&#x7F3A;&#x9677;&#x3002;
&#x2014;&#x2014;&#x67E5;&#x5C14;&#x65AF;&#xB7;&#x5B89;&#x4E1C;&#x5C3C;&#xB7;&#x7406;&#x67E5;&#x5FB7;&#xB7;&#x970D;&#x5C14;&#x7235;&#x58EB;&#xFF08;C. A. R. Hoare&#xFF09;</p>
</blockquote>
<!-- -->
<blockquote>
<p>&#x5728;&#x4EBA;&#x751F;&#x4E2D;&#x53D6;&#x5F97;&#x6210;&#x529F;&#xFF0C;&#x4E0E;&#x5176;&#x8BF4;&#x9760;&#x5929;&#x624D;&#x4E0E;&#x673A;&#x4F1A;&#xFF0C;&#x4E0D;&#x5982;&#x8BF4;&#x9760;&#x4E13;&#x6CE8;&#x4E0E;&#x6BC5;&#x529B;&#x3002;
&#x2014;&#x2014;C. W. Wendte</p>
</blockquote>

        </div>
    
</div>

        
    </body>
</html>

