
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章：基础介绍</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    
        
        <link rel="stylesheet" href="gitbook/ebook.css">
        
    

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/ebook.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    </head>
    <body>
        
<div class="page">
    
        <h1 class="book-chapter book-chapter-1">第一章：基础介绍</h1>
        <div class="section">
            <h1 id="&#x5173;&#x4E8E;-python">&#x5173;&#x4E8E; Python</h1>
<p>Python &#x662F;&#x4E00;&#x79CD;&#x6781;&#x5C11;&#x6570;&#x80FD;&#x58F0;&#x8A00;&#x517C;&#x5177; <em>&#x7B80;&#x5355;</em> &#x4E0E; <em>&#x529F;&#x80FD;&#x5F3A;&#x5927;</em> &#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x4F60;&#x5C06;&#x60CA;&#x5F02;&#x4E8E;&#x53D1;&#x73B0;&#x4F60;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x8FD9;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x662F;&#x5982;&#x6B64;&#x7B80;&#x5355;&#xFF0C;&#x5B83;&#x4E13;&#x6CE8;&#x4E8E;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x975E;&#x62D8;&#x6CE5;&#x4E8E;&#x8BED;&#x6CD5;&#x4E0E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x5B98;&#x65B9;&#x5BF9; Python &#x7684;&#x4ECB;&#x7ECD;&#x5982;&#x4E0B;&#xFF1A;</p>
<blockquote>
<p>Python &#x662F;&#x4E00;&#x6B3E;&#x6613;&#x4E8E;&#x5B66;&#x4E60;&#x4E14;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002; &#x5B83;&#x5177;&#x6709;&#x9AD8;&#x6548;&#x7387;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x80FD;&#x591F;&#x7B80;&#x5355;&#x53C8;&#x6709;&#x6548;&#x5730;&#x5B9E;&#x73B0;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x3002;Python &#x7B80;&#x6D01;&#x7684;&#x8BED;&#x6CD5;&#x4E0E;&#x52A8;&#x6001;&#x8F93;&#x5165;&#x4E4B;&#x7279;&#x6027;&#xFF0C;&#x52A0;&#x4E4B;&#x5176;&#x89E3;&#x91CA;&#x6027;&#x8BED;&#x8A00;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x5728;&#x591A;&#x79CD;&#x9886;&#x57DF;&#x4E0E;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x5E73;&#x53F0;&#x90FD;&#x80FD;&#x8FDB;&#x884C;&#x811A;&#x672C;&#x7F16;&#x5199;&#x4E0E;&#x5E94;&#x7528;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7684;&#x7406;&#x60F3;&#x8BED;&#x8A00;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x5C06;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x3002;</p>
<h2 id="&#x540D;&#x5B57;&#x80CC;&#x540E;&#x7684;&#x6545;&#x4E8B;">&#x540D;&#x5B57;&#x80CC;&#x540E;&#x7684;&#x6545;&#x4E8B;</h2>
<p>Python &#x7684;&#x521B;&#x9020;&#x8005;&#x5409;&#x591A;&#xB7;&#x8303;&#x7F57;&#x82CF;&#x59C6;&#xFF08;Guido van Rossum&#xFF09;&#x91C7;&#x7528; BBC &#x7535;&#x89C6;&#x8282;&#x76EE;&#x300A;&#x8499;&#x63D0;&#xB7;&#x6D3E;&#x68EE;&#x7684;&#x98DE;&#x884C;&#x9A6C;&#x620F;&#x56E2;&#xFF08;Monty Python&apos;s Flying Circus&#xFF0C;&#x4E00;&#x8BD1;&#x5DE8;&#x87D2;&#x5267;&#x56E2;&#xFF09;&#x300B;&#x7684;&#x540D;&#x5B57;&#x6765;&#x4E3A;&#x8FD9;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x547D;&#x540D;&#x3002;&#x5C3D;&#x7BA1;&#x4ED6;&#x672C;&#x4EBA;&#x5E76;&#x4E0D;&#x7279;&#x522B;&#x559C;&#x6B22;&#x87D2;&#x86C7;&#x8FD9;&#x79CD;&#x901A;&#x8FC7;&#x5728;&#x730E;&#x7269;&#x8EAB;&#x8FB9;&#x5377;&#x66F2;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x4EE5;&#x6B64;&#x6765;&#x78BE;&#x788E;&#x730E;&#x7269;&#x8EAB;&#x4F53;&#x6765;&#x8FDB;&#x98DF;&#x7684;&#x52A8;&#x7269;&#x3002;</p>
<h2 id="python-&#x7684;&#x7279;&#x8272;">Python &#x7684;&#x7279;&#x8272;</h2>
<h3 id="&#x7B80;&#x5355;">&#x7B80;&#x5355;</h3>
<p>Python &#x662F;&#x4E00;&#x95E8;&#x7B80;&#x5355;&#x4E14;&#x7B80;&#x7EA6;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x9605;&#x8BFB;&#x4E00;&#x4EFD;&#x4F18;&#x79C0;&#x7684; Python &#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x5C31;&#x5982;&#x540C;&#x5728;&#x9605;&#x8BFB;&#x82F1;&#x8BED;&#x6587;&#x7AE0;&#x4E00;&#x6837;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x95E8;&#x82F1;&#x8BED;&#x8981;&#x6C42;&#x5341;&#x5206;&#x4E25;&#x683C;&#xFF01;Python &#x8FD9;&#x79CD;&#x4F2A;&#x4EE3;&#x7801;&#x5F0F;&#x7684;&#x7279;&#x8D28;&#x6B63;&#x662F;&#x5B83;&#x7684;&#x4E00;&#x5927;&#x4F18;&#x52BF;&#x3002;&#x5B83;&#x80FD;&#x591F;&#x8BA9;&#x4F60;&#x4E13;&#x6CE8;&#x4E8E;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x3002;</p>
<h3 id="&#x6613;&#x4E8E;&#x5B66;&#x4E60;">&#x6613;&#x4E8E;&#x5B66;&#x4E60;</h3>
<p>&#x6B63;&#x5982;&#x4F60;&#x63A5;&#x4E0B;&#x6765;&#x5C06;&#x770B;&#x5230;&#x7684;&#xFF0C;Python &#x662F;&#x4E00;&#x95E8;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5165;&#x95E8;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x6B63;&#x5982;&#x524D;&#x9762;&#x6240;&#x63D0;&#x5230;&#x7684;&#xFF0C;Python &#x6709;&#x4E00;&#x5957;&#x6781;&#x5176;&#x7B80;&#x5355;&#x7684;&#x8BED;&#x6CD5;&#x4F53;&#x7CFB;&#x3002;</p>
<h3 id="&#x81EA;&#x7531;&#x4E14;&#x5F00;&#x653E;">&#x81EA;&#x7531;&#x4E14;&#x5F00;&#x653E;</h3>
<p>Python &#x662F; FLOSS &#xFF08;&#x81EA;&#x7531;/&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x8F6F;&#x4EF6;&#xFF09;&#x7684;&#x6210;&#x5458;&#x4E4B;&#x4E00;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x5206;&#x53D1;&#x8FD9;&#x4E00;&#x8F6F;&#x4EF6;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x9605;&#x8BFB;&#x5B83;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x5BF9;&#x5176;&#x4F5C;&#x51FA;&#x6539;&#x52A8;&#xFF0C;&#x6216;&#x662F;&#x5C06;&#x5176;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x8FD0;&#x7528;&#x4E8E;&#x4E00;&#x6B3E;&#x65B0;&#x7684;&#x81EA;&#x7531;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;FLOSS &#x57FA;&#x4E8E;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5206;&#x4EAB;&#x77E5;&#x8BC6;&#x7684;&#x793E;&#x533A;&#x7406;&#x5FF5;&#x800C;&#x521B;&#x5EFA;&#x3002;&#x8FD9;&#x6B63;&#x662F; Python &#x4E3A;&#x4F55;&#x80FD;&#x5982;&#x6B64;&#x4F18;&#x79C0;&#x7684;&#x4E00;&#x5927;&#x539F;&#x56E0;&#x2014;&#x2014;&#x5B83;&#x7531;&#x4E00;&#x7FA4;&#x5E0C;&#x671B;&#x770B;&#x5230; Python &#x80FD;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x793E;&#x533A;&#x6210;&#x5458;&#x6240;&#x521B;&#x9020;&#xFF0C;&#x5E76;&#x6301;&#x7EED;&#x6539;&#x8FDB;&#x81F3;&#x4ECA;&#x3002;</p>
<h3 id="&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;">&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;</h3>
<p>&#x5F53;&#x4F60;&#x5728;&#x7528; Python &#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x4F60;&#x4E0D;&#x5FC5;&#x8003;&#x8651;&#x8BF8;&#x5982;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5E94;&#x5F53;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x7B49;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#x3002;</p>
<h3 id="&#x8DE8;&#x5E73;&#x53F0;&#x6027;">&#x8DE8;&#x5E73;&#x53F0;&#x6027;</h3>
<p>&#x7531;&#x4E8E;&#x5176;&#x5F00;&#x653E;&#x6E90;&#x7801;&#x7684;&#x7279;&#x6027;&#xFF0C;Python &#x5DF2;&#x88AB;&#x79FB;&#x690D;&#x5230;&#x5176;&#x5B83;&#x8BF8;&#x591A;&#x5E73;&#x53F0;&#xFF08;&#x610F;&#x5373;&#x5B83;&#x4EEC;&#x5DF2;&#x7ECF;&#x8FC7;&#x6539;&#x52A8;&#x4EE5;&#x4FDD;&#x8BC1;&#x5176;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C0F;&#x5FC3;&#x5730;&#x907F;&#x5F00;&#x4E86;&#x6240;&#x6709;&#x7CFB;&#x7EDF;&#x4F9D;&#x8D56;&#x578B;&#x7684;&#x7279;&#x6027;&#x3002;&#x4F60;&#x6240;&#x6709;&#x7684; Python &#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4E2D;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x5FC5;&#x4F5C;&#x51FA;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728; GNU/Linux&#x3001;Windows&#x3001;FreeBSD&#x3001;Macintosh&#x3001; Solaris&#x3001; OS/2&#x3001; Amiga&#x3001; AROS&#x3001; AS/400&#x3001; BeOS&#x3001; OS/390&#x3001; z/OS&#x3001; Palm OS&#x3001; QNX&#x3001; VMS&#x3001; Psion&#x3001; Acorn RISC OS&#x3001; VxWorks&#x3001; PlayStation&#x3001; Sharp Zaurus&#x3001; Windows CE &#x4EE5;&#x53CA; PocketPC &#x5E73;&#x53F0;&#x4E0A;&#x8FD0;&#x884C; Python&#xFF01;</p>
<p>&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BF8;&#x5982; <a href="http://kivy.org" target="_blank">Kivy</a> &#x4E00;&#x7C7B;&#x7684;&#x5E73;&#x53F0;&#x6765;&#x5236;&#x4F5C;&#x53EF;&#x5728;&#x4F60;&#x7684;&#x7535;&#x8111; <em>&#x4EE5;&#x53CA;</em> iPhone&#x3001;iPad &#x6216;&#x5B89;&#x5353;&#x624B;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x6E38;&#x620F;&#x3002;</p>
<h3 id="&#x89E3;&#x91CA;&#x6027;">&#x89E3;&#x91CA;&#x6027;</h3>
<p>&#x6709;&#x5173;&#x8FD9;&#x4E00;&#x7279;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x8BE6;&#x7EC6;&#x7684;&#x89E3;&#x91CA;&#x3002;</p>
<p>&#x5728;&#x4F60;&#x4F7F;&#x7528;&#x8BF8;&#x5982; C &#x6216; C++ &#x7B49;&#x7F16;&#x8BD1;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x901A;&#x8FC7;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x914D;&#x5408;&#x5176;&#x4E2D;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x8BB0;&#xFF08;Flags&#xFF09;&#x4E0E;&#x9009;&#x9879;&#xFF0C;&#x6765;&#x5C06;&#x5B83;&#x4EEC;&#x8F6C;&#x6362;&#x6210;&#x4F60;&#x7684;&#x7535;&#x8111;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#xFF08;&#x4F8B;&#x5982; 0 &#x4E0E; 1 &#x6784;&#x6210;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#xFF09;&#x3002;&#x5F53;&#x4F60;&#x8FD0;&#x884C;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x94FE;&#x63A5;&#x7A0B;&#x5E8F;&#x6216;&#x8F7D;&#x5165;&#x7A0B;&#x5E8F;&#x5C06;&#x4F1A;&#x4ECE;&#x786C;&#x76D8;&#x4E2D;&#x5C06;&#x7A0B;&#x5E8F;&#x62F7;&#x8D1D;&#x81F3;&#x5185;&#x5B58;&#x4E2D;&#x5E76;&#x5C06;&#x5176;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;Python &#x4E0D;&#x9700;&#x8981;&#x5C06;&#x5176;&#x7F16;&#x8BD1;&#x6210;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#x3002;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x4ECE;&#x6E90;&#x4EE3;&#x7801; <em>&#x8FD0;&#x884C;</em> &#x8BE5;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#xFF0C;Python &#x4F1A;&#x5C06;&#x6E90;&#x4EE3;&#x7801;&#x8F6C;&#x6362;&#x4E3A;&#x79F0;&#x4E3A;&#x5B57;&#x8282;&#x7801;&#x7684;&#x4E2D;&#x95F4;&#x5F62;&#x5F0F;&#xFF0C;&#x5C14;&#x540E;&#x518D;&#x8F6C;&#x6362;&#x6210;&#x4F60;&#x7684;&#x7535;&#x8111;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E00;&#x6D41;&#x7A0B;&#x4F7F;&#x5F97; Python &#x66F4;&#x52A0;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x4F60;&#x4E0D;&#x5FC5;&#x518D;&#x62C5;&#x5FC3;&#x8BE5;&#x5982;&#x4F55;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#xFF0C;&#x6216;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x9002;&#x5F53;&#x7684;&#x5E93;&#x88AB;&#x6B63;&#x786E;&#x7684;&#x94FE;&#x63A5;&#x5E76;&#x52A0;&#x8F7D;&#x7B49;&#x7B49;&#x6B65;&#x9AA4;&#x3002;&#x8FD9;&#x4E5F;&#x540C;&#x6837;&#x4F7F;&#x5F97; Python &#x7A0B;&#x5E8F;&#x66F4;&#x4FBF;&#x643A;&#x4E14;&#x6613;&#x4E8E;&#x8FC1;&#x79FB;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x5C06; Python &#x7A0B;&#x5E8F;&#x62F7;&#x8D1D;&#x5230;&#x53E6;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x4FBF;&#x53EF;&#x8BA9;&#x5B83;&#x7ACB;&#x5373;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#xFF01;</p>
<h3 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;">&#x9762;&#x5411;&#x5BF9;&#x8C61;</h3>
<p>Python &#x540C;&#x65F6;&#x652F;&#x6301;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7F16;&#x7A0B;&#x4E0E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x3002;&#x5728; <em>&#x9762;&#x5411;&#x8FC7;&#x7A0B;</em> &#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x662F;&#x7531;&#x4EC5;&#x4EC5;&#x5E26;&#x6709;&#x53EF;&#x91CD;&#x7528;&#x7279;&#x6027;&#x7684;&#x5B50;&#x7A0B;&#x5E8F;&#x4E0E;&#x51FD;&#x6570;&#x6240;&#x6784;&#x5EFA;&#x8D77;&#x6765;&#x7684;&#x3002;&#x5728; <em>&#x9762;&#x5411;&#x5BF9;&#x8C61;</em> &#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x662F;&#x7531;&#x7ED3;&#x5408;&#x4E86;&#x6570;&#x636E;&#x4E0E;&#x529F;&#x80FD;&#x7684;&#x5BF9;&#x8C61;&#x6240;&#x6784;&#x5EFA;&#x8D77;&#x6765;&#x7684;&#x3002;&#x4E0E; C++ &#x6216; Java &#x8FD9;&#x4E9B;&#x5927;&#x578B;&#x8BED;&#x8A00;&#x76F8;&#x6BD4;&#xFF0C;Python &#x5177;&#x6709;&#x5176;&#x7279;&#x522B;&#x7684;&#x3001;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x53C8;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x3002;</p>
<h3 id="&#x53EF;&#x6269;&#x5C55;&#x6027;">&#x53EF;&#x6269;&#x5C55;&#x6027;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x4EE3;&#x7801;&#x7684;&#x67D0;&#x4E00;&#x91CD;&#x8981;&#x90E8;&#x5206;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x5730;&#x8FD0;&#x884C;&#xFF0C;&#x6216;&#x5E0C;&#x671B;&#x7B97;&#x6CD5;&#x7684;&#x67D0;&#x4E9B;&#x90E8;&#x5206;&#x4E0D;&#x88AB;&#x516C;&#x5F00;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728; C &#x6216; C++ &#x8BED;&#x8A00;&#x4E2D;&#x7F16;&#x5199;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5C06;&#x5176;&#x8FD0;&#x7528;&#x4E8E;&#x4F60;&#x7684; Python &#x7A0B;&#x5E8F;&#x4E2D;&#x3002;</p>
<h3 id="&#x53EF;&#x5D4C;&#x5165;&#x6027;">&#x53EF;&#x5D4C;&#x5165;&#x6027;</h3>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4F60;&#x7684; C &#x6216; C++ &#x7A0B;&#x5E8F;&#x4E2D;&#x5D4C;&#x5165; Python&#xFF0C;&#x4ECE;&#x800C;&#x5411;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x7528;&#x6237;&#x63D0;&#x4F9B; <em>&#x811A;&#x672C;</em> &#x529F;&#x80FD;&#x3002;</p>
<h3 id="&#x4E30;&#x5BCC;&#x7684;&#x5E93;">&#x4E30;&#x5BCC;&#x7684;&#x5E93;</h3>
<p>&#x5B9E;&#x9645;&#x4E0A; Python &#x6807;&#x51C6;&#x5E93;&#x7684;&#x89C4;&#x6A21;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#x3002;&#x5B83;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4F60;&#x5B8C;&#x6210;&#x8BF8;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x5305;&#x62EC;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x3001;&#x6587;&#x6863;&#x751F;&#x6210;&#x3001;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3001;&#x591A;&#x7EBF;&#x7A0B;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x7F51;&#x9875;&#x6D4F;&#x89C8;&#x5668;&#x3001;CGI&#x3001;FTP&#x3001;&#x90AE;&#x4EF6;&#x3001;XML&#x3001;XML-RPC&#x3001;HTML&#x3001;WAV &#x6587;&#x4EF6;&#x3001;&#x5BC6;&#x7801;&#x7CFB;&#x7EDF;&#x3001;GUI&#xFF08;&#x56FE;&#x5F62;&#x7528;&#x6237;&#x754C;&#x9762;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x4F9D;&#x8D56;&#x578B;&#x7684;&#x6D3B;&#x52A8;&#x3002;&#x53EA;&#x9700;&#x8BB0;&#x4F4F;&#xFF0C;&#x53EA;&#x8981;&#x5B89;&#x88C5;&#x4E86; Python&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x4FBF;&#x968F;&#x65F6;&#x53EF;&#x7528;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x5728;&#x88AB;&#x79F0;&#x4F5C; Python <em>&#x81EA;&#x5907;&#x7535;&#x6C60;&#xFF08;Batteries Included&#xFF09;</em> &#x5F0F;&#x7684;&#x54F2;&#x5B66;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x6807;&#x51C6;&#x5E93;&#x4EE5;&#x5916;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x5728; <a href="http://pypi.python.org/pypi" target="_blank">Python &#x5E93;&#x7D22;&#x5F15;&#xFF08;Python Package Index&#xFF09;</a> &#x4E2D;&#x53D1;&#x6398;&#x8BB8;&#x591A;&#x5176;&#x5B83;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x5E93;&#x3002;</p>
<h3 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h3>
<p>Python &#x7740;&#x5B9E;&#x662F;&#x4E00;&#x95E8;&#x4EE4;&#x4EBA;&#x5FC3;&#x751F;&#x6FC0;&#x52A8;&#x4E14;&#x5F3A;&#x5927;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x5B83;&#x5F97;&#x5F53;&#x5730;&#x7ED3;&#x5408;&#x4E86;&#x6027;&#x80FD;&#x4E0E;&#x529F;&#x80FD;&#xFF0C;&#x4F7F;&#x5F97;&#x7F16;&#x5199; Python &#x7A0B;&#x5E8F;&#x662F;&#x5982;&#x6B64;&#x7B80;&#x6613;&#x53C8;&#x5145;&#x6EE1;&#x4E50;&#x8DA3;&#x3002;</p>
<h3 id="python-3-vs-python-2">Python 3 VS Python 2</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x201C;Python 2&#x201D;&#x4E0E;&#x201C;Python 3&#x201D;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x4F60;&#x53EF;&#x4EE5;&#x7565;&#x8FC7;&#x672C;&#x6BB5;&#x3002;&#x4F46;&#x52A1;&#x5FC5;&#x6CE8;&#x610F;&#x4F60;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x7248;&#x672C;&#x3002;&#x672C;&#x4E66;&#x662F;&#x4EE5; Python 3 &#x4E3A;&#x5BF9;&#x8C61;&#x64B0;&#x5199;&#x7684;&#x3002;</p>
<p>&#x53EA;&#x6D88;&#x8BB0;&#x4F4F;&#x4E00;&#x65E6;&#x4F60;&#x6B63;&#x786E;&#x7406;&#x89E3;&#x5E76;&#x5B66;&#x4E60;&#x4E86;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x7684; Python&#xFF0C;&#x4F60;&#x4FBF;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x7406;&#x89E3;&#x53E6;&#x4E00;&#x7248;&#x672C;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x5E76;&#x80FD;&#x5FEB;&#x901F;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x3002;&#x56F0;&#x96BE;&#x7684;&#x662F;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x7F16;&#x7A0B;&#x4EE5;&#x53CA;&#x7406;&#x89E3; Python &#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x7684;&#x57FA;&#x7840;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x4FBF;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x800C;&#x4E00;&#x65E6;&#x4F60;&#x8FBE;&#x6210;&#x4E86;&#x76EE;&#x6807;&#xFF0C;&#x4F60;&#x4FBF;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4F60;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x51B3;&#x5B9A;&#x662F;&#x8BE5;&#x4F7F;&#x7528; Python 2 &#x8FD8;&#x662F; Python 3&#x3002;</p>
<p>&#x8981;&#x60F3;&#x4E86;&#x89E3;&#x6709;&#x5173; Python 2 &#x548C; Python 3 &#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x7684;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x53C2;&#x9605;&#xFF1A;</p>
<ul>
<li><a href="http://lwn.net/Articles/547191/" target="_blank">The future of Python 2</a></li>
<li><a href="https://docs.python.org/3/howto/pyporting.html" target="_blank">Porting Python 2 Code to Python 3</a></li>
<li><a href="https://wiki.python.org/moin/PortingToPy3k/BilingualQuickRef" target="_blank">Writing code that runs under both Python2 and 3</a></li>
<li><a href="http://python3porting.com" target="_blank">Supporting Python 3: An in-depth guide</a></li>
</ul>
<h3 id="&#x7A0B;&#x5E8F;&#x5458;&#x600E;&#x4E48;&#x8BF4;">&#x7A0B;&#x5E8F;&#x5458;&#x600E;&#x4E48;&#x8BF4;</h3>
<p>&#x6216;&#x8BB8;&#x4F60;&#x5728;&#x9605;&#x8BFB;&#x8BF8;&#x5982; ESR &#x7B49;&#x4F1F;&#x5927;&#x7684;&#x9ED1;&#x5BA2;&#x662F;&#x5982;&#x4F55;&#x8BA8;&#x8BBA; Python &#x65F6;&#x4F1A;&#x6709;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x53D1;&#x73B0;&#xFF1A;</p>
<ul>
<li><em>&#x57C3;&#x91CC;&#x514B;&#xB7;&#x96F7;&#x8499;&#xFF08;Eric S. Raymond&#xFF09;</em> &#x662F;&#x300A;&#x5927;&#x6559;&#x5802;&#x548C;&#x5E02;&#x96C6;&#xFF08;The Cathedral and the Bazaar&#xFF09;&#x300B;&#x7684;&#x4F5C;&#x8005;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F; <em>&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x4FC3;&#x8FDB;&#x4F1A;</em> &#x7684;&#x521B;&#x59CB;&#x4EBA;&#x4E4B;&#x4E00;&#x3002;&#x4ED6;&#x66FE;&#x8BF4;<a href="http://www.python.org/about/success/esr/" target="_blank">Python &#x5DF2;&#x6210;&#x4E3A;&#x4ED6;&#x6240;&#x559C;&#x7231;&#x7684;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;</a>&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7ED9;&#x4E86;&#x6211;&#x63A5;&#x89E6; Python &#x7684;&#x6700;&#x5148;&#x9F13;&#x821E;&#x3002;</li>
<li><em>&#x5E03;&#x9C81;&#x65AF;&#xB7;&#x57C3;&#x514B;&#x5C14;&#xFF08;Bruce Eckel&#xFF09;</em> &#x662F;&#x300A;Java &#x7F16;&#x7A0B;&#x601D;&#x60F3;&#xFF08;Thinking in Java&#xFF09;&#x300B;&#x4E0E;&#x300A;C++ &#x7F16;&#x7A0B;&#x601D;&#x60F3;&#xFF08;Thinking in C++&#xFF09;&#x300B;&#x7684;&#x4F5C;&#x8005;&#x3002;&#x4ED6;&#x8BF4;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x80FD;&#x50CF; Python &#x8FD9;&#x6837;&#x4F7F;&#x4ED6;&#x66F4;&#x52A0;&#x9AD8;&#x4EA7;&#x3002;&#x4ED6;&#x8BF4;&#x6216;&#x8BB8; Python &#x662F;&#x552F;&#x4E00;&#x4E00;&#x95E8;&#x9762;&#x5411;&#x7A0B;&#x5E8F;&#x5458;&#x4E14;&#x81F4;&#x529B;&#x4E8E;&#x4F7F;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x9605;&#x8BFB; <a href="http://www.artima.com/intv/aboutme.html" target="_blank">&#x5B8C;&#x6574;&#x91C7;&#x8BBF;</a> &#x4EE5;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x3002;</li>
<li><em>&#x5F7C;&#x5F97;&#xB7;&#x8BFA;&#x7C73;&#x683C;&#xFF08;Peter Norvig&#xFF09;</em> &#x662F;&#x5E7F;&#x4E3A;&#x4EBA;&#x77E5;&#x7684; Lisp &#x4F5C;&#x8005;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F; Google &#x516C;&#x53F8;&#x7684;&#x641C;&#x7D22;&#x8D28;&#x91CF;&#x603B;&#x76D1;&#xFF08;Director of Search Quality&#xFF0C;&#x611F;&#x8C22;&#x5409;&#x591A;&#xB7;&#x8303;&#x7F57;&#x82CF;&#x59C6;&#x6307;&#x51FA;&#x8FD9;&#x4E00;&#x70B9;&#xFF09;&#x3002;&#x4ED6;&#x8BF4;<a href="https://news.ycombinator.com/item?id=1803815" target="_blank">&#x5199; Python &#x65F6;&#x5C31;&#x597D;&#x50CF;&#x5728;&#x5199;&#x4F2A;&#x4EE3;&#x7801;</a>&#x3002;&#x4ED6;&#x8FD8;&#x8BF4; Python &#x4E00;&#x76F4;&#x662F;&#x6784;&#x6210; Google &#x6574;&#x4F53;&#x7684;&#x91CD;&#x8981;&#x90E8;&#x5206;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6D4F;&#x89C8; <a href="http://www.google.com/jobs/index.html" target="_blank">Google Jobs</a> &#x9875;&#x9762;&#x5E76;&#x53D1;&#x73B0;&#x201C;Python &#x77E5;&#x8BC6;&#x201D;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x6240;&#x987B;&#x5177;&#x5907;&#x7684;&#x4E00;&#x9879;&#x8981;&#x6C42;&#x6765;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E00;&#x8BF4;&#x6CD5;&#x3002;</li>
</ul>
<h3 id="&#x5173;&#x4E8E;&#x672C;&#x4E66;&#x6240;&#x7528;&#x7684;anaconda-python&#x53D1;&#x884C;&#x7248;">&#x5173;&#x4E8E;&#x672C;&#x4E66;&#x6240;&#x7528;&#x7684;Anaconda Python&#x53D1;&#x884C;&#x7248;</h3>
<div align="center"><img src="d03297f5.png"></div>

<p><a href="https://www.anaconda.com/distribution/" target="_blank">&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;</a>&#xFF0C;&#x5F00;&#x6E90;&#x7684;Anaconda Python&#x6709;&#x673A;&#x7684;&#x6574;&#x5408;&#x4E86;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x9886;&#x57DF;&#x4E2D;&#x5E38;&#x7528;&#x7684;Python&#x5E93;&#xFF0C;&#x4F7F;&#x5F97;Anaconda Python&#x6210;&#x4E3A;&#x4E86;&#x76EE;&#x524D;&#x5728;Linux,Windows&#x548C;Mac&#x4E0A;&#x8FDB;&#x884C;Python&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x548C;Python&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6700;&#x65B9;&#x4FBF;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x80FD;&#x591F;&#x65B9;&#x4FBF;&#x7684;&#x5B89;&#x88C5;&#x548C;&#x7BA1;&#x7406;&#x5404;&#x79CD;Python&#x5E93;&#x548C;Python&#x73AF;&#x5883;&#x3002;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x76F8;&#x5173;&#x7528;&#x6CD5;&#x3002;</p>

        </div>
    
</div>

        
    </body>
</html>

