
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十三章：更多</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    
        
        <link rel="stylesheet" href="gitbook/ebook.css">
        
    

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/ebook.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    </head>
    <body>
        
<div class="page">
    
        <h1 class="book-chapter book-chapter-1">第十三章：更多</h1>
        <div class="section">
            <h1 id="&#x66F4;&#x591A;">&#x66F4;&#x591A;</h1>
<p>&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4ECB;&#x7ECD;&#x5DF2;&#x7ECF;&#x6DB5;&#x76D6;&#x4E86;&#x4F60;&#x5C06;&#x4F7F;&#x7528;&#x5230;&#x7684; Python &#x7684;&#x5927;&#x90E8;&#x5206;&#x65B9;&#x9762;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x7684;&#x65B9;&#x9762;&#xFF0C;&#x6765;&#x8BA9;&#x6211;&#x4EEC;&#x5BF9; Python &#x7684;&#x8BA4;&#x8BC6;&#x66F4;&#x52A0;&#x5168;&#x9762;&#x3002;</p>
<h2 id="&#x4F20;&#x9012;&#x5143;&#x7EC4;">&#x4F20;&#x9012;&#x5143;&#x7EC4;</h2>
<p>&#x4F60;&#x53EF;&#x66FE;&#x5E0C;&#x671B;&#x4ECE;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x8FD4;&#x56DE;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x503C;&#xFF1F;&#x4F60;&#x80FD;&#x505A;&#x5230;&#x7684;&#x3002;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5143;&#x7EC4;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">get_error_details</span><span class="hljs-params">()</span>:</span>
<span class="hljs-meta">... </span>    <span class="hljs-keyword">return</span> (<span class="hljs-number">2</span>, <span class="hljs-string">&apos;details&apos;</span>)
...
<span class="hljs-meta">&gt;&gt;&gt; </span>errnum, errstr = get_error_details()
<span class="hljs-meta">&gt;&gt;&gt; </span>errnum
<span class="hljs-number">2</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>errstr
<span class="hljs-string">&apos;details&apos;</span>
</code></pre>
<p>&#x8981;&#x6CE8;&#x610F;&#x5230; <code>a, b = &lt;some expression&gt;</code> &#x7684;&#x7528;&#x6CD5;&#x4F1A;&#x5C06;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7ED3;&#x679C;&#x89E3;&#x91CA;&#x4E3A;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x503C;&#x7684;&#x4E00;&#x4E2A;&#x5143;&#x7EC4;&#x3002;</p>
<p>&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x5728; Python &#x4E2D;&#x4EA4;&#x6362;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x6700;&#x5FEB;&#x65B9;&#x6CD5;&#x662F;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>a = <span class="hljs-number">5</span>; b = <span class="hljs-number">8</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>a, b
(<span class="hljs-number">5</span>, <span class="hljs-number">8</span>)
<span class="hljs-meta">&gt;&gt;&gt; </span>a, b = b, a
<span class="hljs-meta">&gt;&gt;&gt; </span>a, b
(<span class="hljs-number">8</span>, <span class="hljs-number">5</span>)
</code></pre>
<h2 id="&#x7279;&#x6B8A;&#x65B9;&#x6CD5;">&#x7279;&#x6B8A;&#x65B9;&#x6CD5;</h2>
<p>&#x8BF8;&#x5982; <code>__init__</code> &#x548C; <code>__del__</code> &#x7B49;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x5BF9;&#x4E8E;&#x7C7B;&#x6765;&#x8BF4;&#x6709;&#x7279;&#x6B8A;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x7279;&#x6B8A;&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x6A21;&#x62DF;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x7684;&#x67D0;&#x4E9B;&#x884C;&#x4E3A;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x4E3A;&#x4F60;&#x7684;&#x7C7B;&#x4F7F;&#x7528; <code>x[key]</code> &#x7D22;&#x5F15;&#x64CD;&#x4F5C;&#xFF08;&#x5C31;&#x50CF;&#x4F60;&#x5728;&#x5217;&#x8868;&#x4E0E;&#x5143;&#x7EC4;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x90A3;&#x6837;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x6240;&#x9700;&#x8981;&#x505A;&#x7684;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x5B9E;&#x73B0; <code>__getitem__()</code> &#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BD5;&#x56FE;&#x7406;&#x89E3;&#x5B83;&#xFF0C;&#x5C31;&#x60F3;&#x60F3; Python &#x5C31;&#x662F;&#x5BF9; <code>list</code> &#x7C7B;&#x8FD9;&#x6837;&#x505A;&#x7684;&#xFF01;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x8868;&#x683C;&#x5217;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x7279;&#x6B8A;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4E86;&#x89E3;&#x6240;&#x6709;&#x7684;&#x7279;&#x6B8A;&#x65B9;&#x6CD5;&#xFF0C;&#x8BF7;<a href="http://docs.python.org/3/reference/datamodel.html#special-method-names" target="_blank">&#x53C2;&#x9605;&#x624B;&#x518C;</a>&#x3002;</p>
<ul>
<li><p><code>__init__(self, ...)</code></p>
<ul>
<li>&#x8FD9;&#x4E00;&#x65B9;&#x6CD5;&#x5728;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x88AB;&#x8FD4;&#x56DE;&#x51C6;&#x5907;&#x4F7F;&#x7528;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x3002;</li>
</ul>
</li>
<li><p><code>__del__(self)</code></p>
<ul>
<li>&#x8FD9;&#x4E00;&#x65B9;&#x6CD5;&#x5728;&#x5BF9;&#x8C61;&#x88AB;&#x5220;&#x9664;&#x4E4B;&#x524D;&#x8C03;&#x7528;&#xFF08;&#x5B83;&#x7684;&#x4F7F;&#x7528;&#x65F6;&#x673A;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#xFF0C;&#x6240;&#x4EE5;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x5B83;&#xFF09;</li>
</ul>
</li>
<li><p><code>__str__(self)</code></p>
<ul>
<li>&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528; <code>print</code> &#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x6216; <code>str()</code> &#x88AB;&#x4F7F;&#x7528;&#x65F6;&#x5C31;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;</li>
</ul>
</li>
<li><p><code>__lt__(self, other)</code></p>
<ul>
<li>&#x5F53;<em>&#x5C0F;&#x4E8E;</em>&#x8FD0;&#x7B97;&#x7B26;&#xFF08;&lt;&#xFF09;&#x88AB;&#x4F7F;&#x7528;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x4F7F;&#x7528;&#x5176;&#x5B83;&#x6240;&#x6709;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;+&#x3001;&gt; &#x7B49;&#x7B49;&#xFF09;&#x65F6;&#x90FD;&#x4F1A;&#x6709;&#x7279;&#x6B8A;&#x65B9;&#x6CD5;&#x88AB;&#x8C03;&#x7528;&#x3002;</li>
</ul>
</li>
<li><p><code>__getitem__(self, key)</code></p>
<ul>
<li>&#x4F7F;&#x7528; <code>x[key]</code> &#x7D22;&#x5F15;&#x64CD;&#x4F5C;&#x65F6;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;</li>
</ul>
</li>
<li><p><code>__len__(self)</code></p>
<ul>
<li>&#x5F53;&#x9488;&#x5BF9;&#x5E8F;&#x5217;&#x5BF9;&#x8C61;&#x4F7F;&#x7528;&#x5185;&#x7F6E; <code>len()</code> &#x51FD;&#x6570;&#x65F6;&#x4F1A;&#x88AB;&#x8C03;&#x7528;</li>
</ul>
</li>
</ul>
<h2 id="&#x5355;&#x8BED;&#x53E5;&#x5757;">&#x5355;&#x8BED;&#x53E5;&#x5757;</h2>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89C1;&#x8BC6;&#x8FC7;&#x6BCF;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x5757;&#x90FD;&#x7531;&#x5176;&#x81EA;&#x8EAB;&#x7684;&#x7F29;&#x8FDB;&#x7EA7;&#x522B;&#x4E0E;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x76F8;&#x533A;&#x5206;&#x3002; &#x662F;&#x8FD9;&#x6837;&#x6CA1;&#x9519;&#xFF0C;&#x4E0D;&#x8FC7;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x8B66;&#x544A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8BED;&#x53E5;&#x5757;&#x53EA;&#x5305;&#x62EC;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x53E5;&#x8BED;&#x53E5;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x540C;&#x4E00;&#x884C;&#x6307;&#x5B9A;&#x5B83;&#xFF0C;&#x4F8B;&#x5982;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x4E0E;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x3002;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5E94;&#x8BE5;&#x80FD;&#x6BD4;&#x8F83;&#x6E05;&#x695A;&#x5730;&#x89E3;&#x91CA;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>flag = <span class="hljs-keyword">True</span>
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">if</span> flag: print(<span class="hljs-string">&apos;Yes&apos;</span>)
...
Yes
</code></pre>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x5355;&#x4E2A;&#x8BED;&#x53E5;&#x662F;&#x5728;&#x539F;&#x5730;&#x7ACB;&#x5373;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x88AB;&#x770B;&#x4F5C;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5757;&#x3002;&#x5C3D;&#x7BA1;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x4F7F;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x66F4;&#x52A0;<em>&#x5C0F;&#x5DE7;</em>&#xFF0C;&#x4F46;&#x9664;&#x975E;&#x662F;&#x4E3A;&#x4E86;&#x68C0;&#x67E5;&#x9519;&#x8BEF;&#xFF0C;&#x6211;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4F60;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x5FEB;&#x6377;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5C0F;&#x5FC3;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x6070;&#x5230;&#x597D;&#x5904;&#x201D;&#x7684;&#x7F29;&#x8FDB;&#xFF0C;&#x5B83;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x6DFB;&#x52A0;&#x8FDB;&#x989D;&#x5916;&#x7684;&#x8BED;&#x53E5;&#x3002;</p>
<h2 id="lambda-&#x8868;&#x683C;">Lambda &#x8868;&#x683C;</h2>
<p><code>lambda</code> &#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x3002;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x8BF4;&#xFF0C;<code>lambda</code> &#x9700;&#x8981;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x540E;&#x8DDF;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4F5C;&#x4E3A;&#x51FD;&#x6570;&#x4F53;&#xFF0C;&#x8FD9;&#x4E00;&#x8868;&#x8FBE;&#x5F0F;&#x6267;&#x884C;&#x7684;&#x503C;&#x5C06;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x65B0;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x3002;</p>
<p>&#x6848;&#x4F8B;&#xFF08;&#x4FDD;&#x5B58;&#x4E3A; <code>more_lambda.py</code>&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python">points = [{<span class="hljs-string">&apos;x&apos;</span>: <span class="hljs-number">2</span>, <span class="hljs-string">&apos;y&apos;</span>: <span class="hljs-number">3</span>},
          {<span class="hljs-string">&apos;x&apos;</span>: <span class="hljs-number">4</span>, <span class="hljs-string">&apos;y&apos;</span>: <span class="hljs-number">1</span>}]
points.sort(key=<span class="hljs-keyword">lambda</span> i: i[<span class="hljs-string">&apos;y&apos;</span>])
print(points)
</code></pre>

<p>&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code>$ python more_lambda.py
[{&apos;y&apos;: 1, &apos;x&apos;: 4}, {&apos;y&apos;: 3, &apos;x&apos;: 2}]
</code></pre>

<p><strong>&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;</strong></p>
<p>&#x8981;&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x4E2A; <code>list</code> &#x7684; <code>sort</code> &#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4E00;&#x4E2A; <code>key</code> &#x53C2;&#x6570;&#xFF0C;&#x7528;&#x4EE5;&#x51B3;&#x5B9A;&#x5217;&#x8868;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;&#xFF08;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x53EA;&#x77E5;&#x9053;&#x5347;&#x5E8F;&#x4E0E;&#x964D;&#x5E8F;&#xFF09;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6848;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x81EA;&#x5B9A;&#x4E49;&#x6392;&#x5E8F;&#xFF0C;&#x4E3A;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x4E0D;&#x662F;&#x4E3A;&#x51FD;&#x6570;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684; <code>def</code> &#x5757;&#xFF0C;&#x53EA;&#x5728;&#x8FD9;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Lambda &#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x51FD;&#x6570;&#x3002;</p>
<h2 id="&#x5217;&#x8868;&#x63A8;&#x5BFC;">&#x5217;&#x8868;&#x63A8;&#x5BFC;</h2>
<p>&#x5217;&#x8868;&#x63A8;&#x5BFC;&#xFF08;List Comprehension&#xFF09;&#x7528;&#x4E8E;&#x4ECE;&#x4E00;&#x4EFD;&#x73B0;&#x6709;&#x7684;&#x5217;&#x8868;&#x4E2D;&#x5F97;&#x5230;&#x4E00;&#x4EFD;&#x65B0;&#x5217;&#x8868;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4EFD;&#x6570;&#x5B57;&#x5217;&#x8868;&#xFF0C;&#x4F60;&#x60F3;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x76F8;&#x5E94;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#x5728;&#x5927;&#x4E8E; 2 &#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C06;&#x4E58;&#x4EE5; 2&#x3002;&#x5217;&#x8868;&#x63A8;&#x5BFC;&#x5C31;&#x662F;&#x8FD9;&#x7C7B;&#x60C5;&#x51B5;&#x7684;&#x7406;&#x60F3;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x6848;&#x4F8B;&#xFF08;&#x4FDD;&#x5B58;&#x4E3A; <code>more_list_comprehension.py</code>&#xFF09;&#xFF1A;</p>
<pre><code class="lang-python">listone = [<span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>]
listtwo = [<span class="hljs-number">2</span>*i <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> listone <span class="hljs-keyword">if</span> i &gt; <span class="hljs-number">2</span>]
print(listtwo)
</code></pre>

<p>&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code>$ python more_list_comprehension.py
[6, 8]
</code></pre>

<p><strong>&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;</strong></p>
<p>&#x5728;&#x672C;&#x6848;&#x4F8B;&#x4E2D;&#xFF0C;&#x5F53;&#x6EE1;&#x8DB3;&#x4E86;&#x67D0;&#x4E9B;&#x6761;&#x4EF6;&#x65F6;&#xFF08;<code>if i &gt; 2</code>&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x6307;&#x5B9A;&#x7684;&#x64CD;&#x4F5C;&#xFF08;<code>2*i</code>&#xFF09;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x83B7;&#x5F97;&#x4E00;&#x4EFD;&#x65B0;&#x7684;&#x5217;&#x8868;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x5230;&#x539F;&#x59CB;&#x5217;&#x8868;&#x4F9D;&#x65E7;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x5217;&#x8868;&#x63A8;&#x5BFC;&#x7684;&#x4F18;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x6765;&#x5904;&#x7406;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5E76;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x5230;&#x65B0;&#x7684;&#x5217;&#x8868;&#x4E2D;&#x65F6;&#x65F6;&#xFF0C;&#x5B83;&#x80FD;&#x51CF;&#x5C11;&#x6837;&#x677F;&#xFF08;Boilerplate&#xFF09;&#x4EE3;&#x7801;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
<h2 id="&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x63A5;&#x6536;&#x5143;&#x7EC4;&#x4E0E;&#x5B57;&#x5178;">&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x63A5;&#x6536;&#x5143;&#x7EC4;&#x4E0E;&#x5B57;&#x5178;</h2>
<p>&#x6709;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x5206;&#x522B;&#x4F7F;&#x7528; <code>*</code> &#x6216; <code>**</code> &#x4F5C;&#x4E3A;&#x5143;&#x7EC4;&#x6216;&#x5B57;&#x5178;&#x7684;&#x524D;&#x7F00;&#xFF0C;&#x6765;&#x4F7F;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E3A;&#x51FD;&#x6570;&#x6240;&#x63A5;&#x6536;&#x3002;&#x5F53;&#x51FD;&#x6570;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x53EF;&#x53D8;&#x6570;&#x91CF;&#x7684;&#x5B9E;&#x53C2;&#x65F6;&#xFF0C;&#x8FD9;&#x5C06;&#x9887;&#x4E3A;&#x6709;&#x7528;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">powersum</span><span class="hljs-params">(power, *args)</span>:</span>
<span class="hljs-meta">... </span>    <span class="hljs-string">&apos;&apos;&apos;Return the sum of each argument raised to the specified power.&apos;&apos;&apos;</span>
<span class="hljs-meta">... </span>    total = <span class="hljs-number">0</span>
<span class="hljs-meta">... </span>    <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> args:
<span class="hljs-meta">... </span>        total += pow(i, power)
<span class="hljs-meta">... </span>    <span class="hljs-keyword">return</span> total
...
<span class="hljs-meta">&gt;&gt;&gt; </span>powersum(<span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>)
<span class="hljs-number">25</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>powersum(<span class="hljs-number">2</span>, <span class="hljs-number">10</span>)
<span class="hljs-number">100</span>
</code></pre>
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728; <code>args</code> &#x53D8;&#x91CF;&#x524D;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A; <code>*</code> &#x524D;&#x7F00;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x6240;&#x6709;&#x5176;&#x5B83;&#x7684;&#x989D;&#x5916;&#x53C2;&#x6570;&#x90FD;&#x5C06;&#x4F20;&#x9012;&#x5230; <code>args</code> &#x4E2D;&#xFF0C;&#x5E76;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5143;&#x7EC4;&#x4E88;&#x4EE5;&#x50A8;&#x5B58;&#x3002;&#x5982;&#x679C;&#x91C7;&#x7528;&#x7684;&#x662F; <code>**</code> &#x524D;&#x7F00;&#xFF0C;&#x5219;&#x989D;&#x5916;&#x7684;&#x53C2;&#x6570;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x5B57;&#x5178;&#x7684;&#x952E;&#x503C;&#x2014;&#x503C;&#x914D;&#x5BF9;&#x3002;</p>
<h2 id="assert"><code>assert</code> &#x8BED;&#x53E5; </h2>
<p><code>assert</code> &#x8BED;&#x53E5;&#x7528;&#x4EE5;&#x65AD;&#x8A00;&#xFF08;Assert&#xFF09;&#x67D0;&#x4E8B;&#x662F;&#x771F;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x8BF4;&#x4F60;&#x975E;&#x5E38;&#x786E;&#x5B9A;&#x4F60;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5217;&#x8868;&#x4E2D;&#x81F3;&#x5C11;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x60F3;&#x786E;&#x8BA4;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E0D;&#x662F;&#x771F;&#x7684;&#xFF0C;&#x5C31;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;<code>assert</code> &#x8BED;&#x53E5;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x7406;&#x60F3;&#x9009;&#x62E9;&#x3002;&#x5F53;&#x8BED;&#x53E5;&#x65AD;&#x8A00;&#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x5C06;&#x4F1A;&#x629B;&#x51FA; <code>AssertionError</code>&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-meta">&gt;&gt;&gt; </span>mylist = [<span class="hljs-string">&apos;item&apos;</span>]
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">assert</span> len(mylist) &gt;= <span class="hljs-number">1</span>
<span class="hljs-meta">&gt;&gt;&gt; </span>mylist.pop()
<span class="hljs-string">&apos;item&apos;</span>
<span class="hljs-meta">&gt;&gt;&gt; </span><span class="hljs-keyword">assert</span> len(mylist) &gt;= <span class="hljs-number">1</span>
Traceback (most recent call last):
  File <span class="hljs-string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="hljs-number">1</span>, <span class="hljs-keyword">in</span> &lt;module&gt;
AssertionError
</code></pre>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x660E;&#x667A;&#x5730;&#x9009;&#x7528; <code>assert</code> &#x8BED;&#x53E5;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x597D;&#x8FC7;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#xFF0C;&#x4E5F;&#x597D;&#x8FC7;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x6216;&#x5411;&#x7528;&#x6237;&#x663E;&#x793A;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x7136;&#x540E;&#x9000;&#x51FA;&#x3002;</p>
<h2 id="decorator">&#x88C5;&#x9970;&#x5668; </h2>
<p>&#x88C5;&#x9970;&#x5668;&#xFF08;Decorators&#xFF09;&#x662F;&#x5E94;&#x7528;&#x5305;&#x88C5;&#x51FD;&#x6570;&#x7684;&#x5FEB;&#x6377;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x5C06;&#x67D0;&#x4E00;&#x529F;&#x80FD;&#x4E0E;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x5730;&#x201C;&#x5305;&#x88C5;&#x201D;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4E3A;&#x81EA;&#x5DF1;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A; <code>retry</code> &#x88C5;&#x9970;&#x5668;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x8FD0;&#x7528;&#x5230;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x4E4B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x4E2D;&#x629B;&#x51FA;&#x4E86;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x5C1D;&#x8BD5;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x5927;&#x6B21;&#x6570; 5 &#x6B21;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x4F60;&#x5728;&#x5BF9;&#x4E00;&#x53F0;&#x8FDC;&#x7A0B;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x884C;&#x7F51;&#x7EDC;&#x8C03;&#x7528;&#x7684;&#x60C5;&#x51B5;&#x5341;&#x5206;&#x6709;&#x7528;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> time <span class="hljs-keyword">import</span> sleep
<span class="hljs-keyword">from</span> functools <span class="hljs-keyword">import</span> wraps
<span class="hljs-keyword">import</span> logging
logging.basicConfig()
log = logging.getLogger(<span class="hljs-string">&quot;retry&quot;</span>)


<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">retry</span><span class="hljs-params">(f)</span>:</span>
<span class="hljs-meta">    @wraps(f)</span>
    <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">wrapped_f</span><span class="hljs-params">(*args, **kwargs)</span>:</span>
        MAX_ATTEMPTS = <span class="hljs-number">5</span>
        <span class="hljs-keyword">for</span> attempt <span class="hljs-keyword">in</span> range(<span class="hljs-number">1</span>, MAX_ATTEMPTS + <span class="hljs-number">1</span>):
            <span class="hljs-keyword">try</span>:
                <span class="hljs-keyword">return</span> f(*args, **kwargs)
            <span class="hljs-keyword">except</span>:
                log.exception(<span class="hljs-string">&quot;Attempt %s/%s failed : %s&quot;</span>,
                              attempt,
                              MAX_ATTEMPTS,
                              (args, kwargs))
                sleep(<span class="hljs-number">10</span> * attempt)
        log.critical(<span class="hljs-string">&quot;All %s attempts failed : %s&quot;</span>,
                     MAX_ATTEMPTS,
                     (args, kwargs))
    <span class="hljs-keyword">return</span> wrapped_f


counter = <span class="hljs-number">0</span>


<span class="hljs-meta">@retry</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">save_to_database</span><span class="hljs-params">(arg)</span>:</span>
    print(<span class="hljs-string">&quot;Write to a database or make a network call or etc.&quot;</span>)
    print(<span class="hljs-string">&quot;This will be automatically retried if exception is thrown.&quot;</span>)
    <span class="hljs-keyword">global</span> counter
    counter += <span class="hljs-number">1</span>
    <span class="hljs-comment"># &#x8FD9;&#x5C06;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;&#x65F6;&#x629B;&#x51FA;&#x5F02;&#x5E38;</span>
    <span class="hljs-comment"># &#x5728;&#x7B2C;&#x4E8C;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#x5C06;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x91CD;&#x8BD5;&#xFF09;</span>
    <span class="hljs-keyword">if</span> counter &lt; <span class="hljs-number">2</span>:
        <span class="hljs-keyword">raise</span> ValueError(arg)


<span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&apos;__main__&apos;</span>:
    save_to_database(<span class="hljs-string">&quot;Some bad value&quot;</span>)
</code></pre>

<p>&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code>$ python more_decorator.py
Write to a database or make a network call or etc.
This will be automatically retried if exception is thrown.
ERROR:retry:Attempt 1/5 failed : ((&apos;Some bad value&apos;,), {})
Traceback (most recent call last):
  File &quot;more_decorator.py&quot;, line 14, in wrapped_f
    return f(*args, **kwargs)
  File &quot;more_decorator.py&quot;, line 39, in save_to_database
    raise ValueError(arg)
ValueError: Some bad value
Write to a database or make a network call or etc.
This will be automatically retried if exception is thrown.
</code></pre>

<p><strong>&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;</strong></p>
<p>&#x8BF7;&#x53C2;&#x9605;&#xFF1A;</p>
<ul>
<li><a href="http://www.ibm.com/developerworks/linux/library/l-cpdecor.html" target="_blank">http://www.ibm.com/developerworks/linux/library/l-cpdecor.html</a></li>
<li><a href="http://toumorokoshi.github.io/dry-principles-through-python-decorators.html" target="_blank">http://toumorokoshi.github.io/dry-principles-through-python-decorators.html</a></li>
</ul>
<h2 id="two-vs-three">Python 2 &#x4E0E; Python 3 &#x7684;&#x4E0D;&#x540C; </h2>
<p>&#x8BF7;&#x53C2;&#x9605;&#xFF1A;</p>
<ul>
<li><a href="http://pythonhosted.org/six/" target="_blank">&quot;Six&quot; library</a></li>
<li><a href="http://lucumr.pocoo.org/2013/5/21/porting-to-python-3-redux/" target="_blank">Porting to Python 3 Redux by Armin</a></li>
<li><a href="http://pydanny.com/experiences-with-django-python3.html" target="_blank">Python 3 experience by PyDanny</a></li>
<li><a href="https://docs.djangoproject.com/en/dev/topics/python3/" target="_blank">Official Django Guide to Porting to Python 3</a></li>
<li><a href="http://www.reddit.com/r/Python/comments/22ovb3/what_are_the_advantages_to_python_3x/" target="_blank">Discussion on What are the advantages to python 3.x?</a></li>
</ul>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x6211;&#x4EEC;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#x4E86;&#x6709;&#x5173; Python &#x7684;&#x66F4;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x8FD8;&#x672A;&#x6DB5;&#x76D6;&#x5230; Python &#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6D89;&#x730E;&#x4E86;&#x5927;&#x591A;&#x6570;&#x4F60;&#x5C06;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x8DB3;&#x4EE5;&#x8BA9;&#x4F60;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x4EFB;&#x4F55;&#x4F60;&#x6240;&#x671F;&#x671B;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x8FDB;&#x4E00;&#x6B65;&#x63A2;&#x7D22; Python&#x3002;</p>

        </div>
    
</div>

        
    </body>
</html>

