
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>附录：本书由来与修订历史</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    
        
        <link rel="stylesheet" href="gitbook/ebook.css">
        
    

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/ebook.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    </head>
    <body>
        
<div class="page">
    
        <h1 class="book-chapter book-chapter-1">附录：本书由来与修订历史</h1>
        <div class="section">
            <h1 id="history-lesson">&#x9644;&#x5F55;&#xFF1A;&#x672C;&#x4E66;&#x7531;&#x6765; </h1>
<p>&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528; Python &#x662F;&#x56E0;&#x4E3A;&#x6211;&#x9700;&#x8981;&#x4E3A;&#x6211;&#x6240;&#x7F16;&#x5199;&#x7684; &#x201C;&#x94BB;&#x77F3;&#xFF08;Diamond&#xFF09;&#x201D;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5B89;&#x88C5;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x5C31;&#x80FD;&#x8BA9;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x66F4;&#x52A0;&#x4FBF;&#x6377;&#x3002;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x5728; Qt &#x5E93;&#x7684; Python &#x4E0E; Perl &#x7684;&#x7ED1;&#x5B9A;&#x95F4;&#x505A;&#x51FA;&#x9009;&#x62E9;&#x3002;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x4E86;&#x505A;&#x4E86;&#x4E9B;&#x7814;&#x7A76;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4FBF;&#x53D1;&#x73B0;&#x4E86;<a href="http://www.python.org/about/success/esr/" target="_blank">&#x57C3;&#x91CC;&#x514B;&#xB7;&#x96F7;&#x8499;&#xFF08;Eric S. Raymond&#xFF09;&#x64B0;&#x5199;&#x7684;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;</a>&#xFF0C;&#x57C3;&#x91CC;&#x514B;&#x662F;&#x4E00;&#x540D;&#x8457;&#x540D;&#x4E14;&#x5907;&#x53D7;&#x5C0A;&#x91CD;&#x7684;&#x9ED1;&#x5BA2;&#xFF0C;&#x5728;&#x6587;&#x7AE0;&#x4E2D;&#x4ED6;&#x8BF4; Python &#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E86;&#x4ED6;&#x6700;&#x559C;&#x6B22;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x540C;&#x65F6;&#x6211;&#x4E5F;&#x53D1;&#x73B0;&#x76F8;&#x6BD4;&#x8D77;  Perl-Qt &#x7ED1;&#x5B9A;&#xFF0C; PyQt &#x7ED1;&#x5B9A;&#x66F4;&#x52A0;&#x6210;&#x719F;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x51B3;&#x5B9A; Python &#x5C06;&#x6210;&#x4E3A;&#x6211;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4FBF;&#x5F00;&#x59CB;&#x641C;&#x5BFB;&#x9488;&#x5BF9; Python &#x7684;&#x597D;&#x4E66;&#x3002;&#x4F46;&#x662F;&#x6211;&#x627E;&#x4E0D;&#x5230;&#xFF01;&#x6211;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E9B; O&apos;Reilly &#x7684;&#x4E66;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x90FD;&#x5341;&#x5206;&#x6602;&#x8D35;&#xFF0C;&#x800C;&#x4E14;&#x6BD4;&#x8D77;&#x6559;&#x6750;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x672C;&#x53C2;&#x8003;&#x624B;&#x518C;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x901A;&#x8FC7; Python &#x5B98;&#x65B9;&#x6587;&#x6863;&#x6765;&#x89E3;&#x51B3;&#x4E86;&#x5B66;&#x4E60;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8FC7;&#x5B83;&#x4EEC;&#x90FD;&#x592A;&#x7B80;&#x7565;&#x77ED;&#x5C0F;&#x3002;&#x5B83;&#x786E;&#x5B9E;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x5173; Python &#x7684;&#x4F18;&#x79C0;&#x89C2;&#x5FF5;&#x4E0E;&#x89C6;&#x89D2;&#xFF0C;&#x4F46;&#x8FD8;&#x4E0D;&#x591F;&#x5B8C;&#x6574;&#x3002;&#x6211;&#x80FD;&#x591F;&#x9A7E;&#x9A6D;&#x5B83;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x65B0;&#x624B;&#x6765;&#x8BF4;&#x8FD9;&#x5C31;&#x5B8C;&#x5168;&#x4E0D;&#x9002;&#x5408;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4E0E; Python &#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x7684;&#x516D;&#x4E2A;&#x6708;&#x540E;&#xFF0C;&#x6211;&#x5B89;&#x88C5;&#x4E86;&#xFF08;&#x5728;&#x5F53;&#x65F6;&#xFF09;&#x6700;&#x65B0;&#x7684; Red Hat 9.0 Linux&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x4F7F;&#x7528; KWord&#x3002;&#x6211;&#x5BF9;&#x8FD9;&#x6B3E;&#x8F6F;&#x4EF6;&#x5174;&#x594B;&#x4E0D;&#x5DF2;&#xFF0C;&#x7A81;&#x7136;&#x53D8;&#x6709;&#x4E86;&#x5199;&#x4E00;&#x4E9B;&#x6709;&#x5173; Python &#x7684;&#x4E1C;&#x897F;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x6700;&#x5F00;&#x59CB;&#x6211;&#x53EA;&#x5199;&#x4E86;&#x51E0;&#x9875;&#x4F46;&#x5F88;&#x5FEB;&#x5B83;&#x4FBF;&#x53D8;&#x6210;&#x4E86; 30 &#x9875;&#x957F;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x5728;&#x8FD9;&#x65F6;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x8BA4;&#x771F;&#x8003;&#x8651;&#x5C06;&#x5176;&#x6F14;&#x53D8;&#x6210;&#x66F4;&#x4E3A;&#x6709;&#x7528;&#x7684;&#x56FE;&#x4E66;&#x5F62;&#x5F0F;&#x3002;&#x5728;&#x5386;&#x7ECF;&#x4E86;&#x76F8;&#x5F53;<em>&#x591A;</em>&#x7684;&#x91CD;&#x5199;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x7EC8;&#x4E8E;&#x6210;&#x4E3A;&#x4E00;&#x4EFD;&#x6709;&#x6240;&#x7528;&#x5904;&#x7684; Python &#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x6307;&#x5357;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x8003;&#x8651;&#x5C06;&#x8FD9;&#x672C;&#x4E66;&#x4F5C;&#x4E3A;&#x6211;&#x5BF9;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x8D21;&#x732E;&#x4E0E;&#x81F4;&#x656C;&#x3002;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x6700;&#x521D;&#x662F;&#x4F5C;&#x4E3A;&#x6211;&#x4E2A;&#x4EBA;&#x7684; Python &#x7B14;&#x8BB0;&#x800C;&#x5B58;&#x5728;&#xFF0C;&#x5728;&#x672A;&#x6765;&#x6211;&#x60F3;&#x8FD8;&#x4F1A;&#x4F9D;&#x65E7;&#x5982;&#x6B64;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x5DF2;&#x7ECF;&#x5BF9;&#x5176;&#x4F5C;&#x51FA;&#x4E86;&#x8BB8;&#x591A;&#x52AA;&#x529B;&#x8BA9;&#x5B83;&#x5728;&#x4ED6;&#x4EBA;&#x9762;&#x524D;&#x80FD;&#x591F;&#x663E;&#x5F97;&#x66F4;&#x4E3A;&#x53EF;&#x53E3;&#x3002;:)</p>
<p>&#x56E0;&#x4E3A;&#x6709;&#x7740;&#x771F;&#x6B63;&#x7684;&#x5F00;&#x6E90;&#x7CBE;&#x795E;&#xFF0C;&#x6211;&#x6536;&#x5230;&#x4E86;&#x6765;&#x81EA;&#x70ED;&#x5FC3;&#x8BFB;&#x8005;&#x7684;&#x8BB8;&#x591A;&#x5EFA;&#x8BBE;&#x6027;&#x5EFA;&#x8BAE;&#x3001;&#x6279;&#x8BC4;&#x4E0E;<a href="index.html#who-reads-bop">&#x53CD;&#x9988;</a>&#xFF0C;&#x8FD9;&#x4E9B;&#x5728;&#x6211;&#x6539;&#x8FDB;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5BF9;&#x6211;&#x5E2E;&#x52A9;&#x9887;&#x6DF1;&#x3002;</p>
<h2 id="&#x672C;&#x4E66;&#x76EE;&#x524D;&#x7684;&#x72B6;&#x6001;">&#x672C;&#x4E66;&#x76EE;&#x524D;&#x7684;&#x72B6;&#x6001;</h2>
<p>&#x672C;&#x4E66;&#x9700;&#x8981;&#x6765;&#x81EA;&#x5B83;&#x7684;&#x8BFB;&#x8005;&#x5E2E;&#x52A9;&#xFF0C;&#x4F8B;&#x5982;&#x7531;&#x4F60;&#x6765;&#x6307;&#x51FA;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x8FD8;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x6216;&#x6574;&#x4E2A;&#x5C31;&#x662F;&#x9519;&#x7684;&#x3002;&#x8BF7;<a href="http://www.swaroopch.com/contact/" target="_blank">&#x5199;&#x4FE1;&#x7ED9;&#x4E3B;&#x8981;&#x4F5C;&#x8005;</a> &#x6216;&#x8005;&#x5411;&#x76F8;&#x5E94;&#x7684;<a href="23.translations.md#translations">&#x8BD1;&#x8005;</a>&#x63D0;&#x4EA4;&#x4F60;&#x7684;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#x3002;</p>
<h1 id="revision-history">&#x9644;&#x5F55;&#xFF1A;&#x4FEE;&#x8BA2;&#x5386;&#x53F2; </h1>
<ul>
<li>4.0<ul>
<li>2016 &#x5E74; 1 &#x6708; 19 &#x65E5;</li>
<li>&#x5207;&#x6362;&#x56DE; Python 3&#x3002;</li>
<li>&#x5207;&#x6362;&#x81F3; Markdown&#xFF0C;&#x91C7;&#x7528; <a href="https://www.gitbook.com" target="_blank">GitBook</a> &#x4E0E; <a href="http://spacemacs.org" target="_blank">Spacemacs</a>&#x3002;</li>
</ul>
</li>
<li><p>3.0</p>
<ul>
<li>2014 &#x5E74; 3 &#x6708; 31 &#x65E5;</li>
<li>&#x4E3A; Python 2 &#x8FDB;&#x884C;&#x91CD;&#x5199;&#xFF0C;&#x91C7;&#x7528; <a href="http://asciidoctor.org/docs/what-is-asciidoc/" target="_blank">AsciiDoc</a> &#x4E0E; <a href="https://github.com/sensorflo/adoc-mode/wiki" target="_blank">adoc-mode</a>&#x3002;</li>
</ul>
</li>
<li><p>2.0</p>
<ul>
<li>2012 &#x5E74; 10 &#x6708; 20 &#x65E5;</li>
<li>&#x5728; <a href="http://johnmacfarlane.net/pandoc/README.html" target="_blank">Pandoc &#x683C;&#x5F0F;</a>&#x4E0B;&#x91CD;&#x5199;&#xFF0C;&#x611F;&#x8C22;&#x6211;&#x7684;&#x59BB;&#x5B50;&#xFF0C;&#x662F;&#x5979;&#x5B8C;&#x6210;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x4ECE; MediaWiki &#x683C;&#x5F0F;&#x8F6C;&#x6362;&#x6587;&#x672C;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x5316;&#x6587;&#x672C;&#xFF0C;&#x5220;&#x9664;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x8BF8;&#x5982; <code>nonlocal</code> &#x4E0E;&#x5143;&#x7C7B;&#x3002;</li>
</ul>
</li>
<li><p>1.90</p>
<ul>
<li>2008 &#x5E74; 9 &#x6708; 4 &#x65E5;&#xFF0C;&#x76EE;&#x524D;&#x4ECD;&#x5728;&#x63A8;&#x8FDB;&#x4E2D;</li>
<li>&#x5728; 3.5 &#x5E74;&#x7684;&#x6B62;&#x606F;&#x540E;&#x91CD;&#x65B0;&#x590D;&#x5174;&#xFF01;</li>
<li>&#x4E3A; Python 3.0 &#x8FDB;&#x884C;&#x91CD;&#x5199;&#x3002;</li>
<li>&#xFF08;&#x518D;&#x6B21;&#xFF09;&#x91C7;&#x7528; <a href="http://www.mediawiki.org" target="_blank">MediaWiki</a> &#x8FDB;&#x884C;&#x91CD;&#x5199;&#x3002;</li>
</ul>
</li>
<li><p>1.20</p>
<ul>
<li>2005 &#x5E74; 1 &#x6708; 13 &#x65E5;</li>
<li>&#x5728; <a href="http://fedoraproject.org/" target="_blank">Fedora</a> Core 3 &#x4E0B;&#x4F7F;&#x7528; <a href="https://en.wikipedia.org/wiki/Quanta_Plus" target="_blank">Quanta+</a> &#x5168;&#x9762;&#x91CD;&#x5199;&#x3002;&#x589E;&#x6DFB;&#x4E86;&#x8BF8;&#x591A;&#x65B0;&#x7684;&#x6848;&#x4F8B;&#x3002;&#x91CD;&#x5EFA;&#x4E86;&#x6211;&#x7684; DocBook &#x914D;&#x7F6E;&#x3002;</li>
</ul>
</li>
<li><p>1.15</p>
<ul>
<li>2004 &#x5E74; 3 &#x6708; 28 &#x65E5;</li>
<li>&#x96F6;&#x6563;&#x4FEE;&#x6539;&#x3002;</li>
</ul>
</li>
<li><p>1.12</p>
<ul>
<li>2004 &#x5E74; 3 &#x6708; 16 &#x65E5;</li>
<li>&#x8865;&#x5145;&#x4E0E;&#x4FEE;&#x6B63;&#x3002;</li>
</ul>
</li>
<li><p>1.10</p>
<ul>
<li>2004 &#x5E74; 3 &#x6708; 9 &#x65E5;</li>
<li>&#x4FEE;&#x6B63;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x62FC;&#x5199;&#x9519;&#x8BEF;&#xFF0C;&#x611F;&#x8C22;&#x8FD9;&#x4E48;&#x591A;&#x70ED;&#x5FC3;&#x4E14;&#x5927;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x8BFB;&#x8005;&#x3002;</li>
</ul>
</li>
<li><p>1.00</p>
<ul>
<li>2004 &#x5E74; 3 &#x6708; 8 &#x65E5;</li>
<li>&#x5728;&#x8BFB;&#x8005;&#x63D0;&#x51FA;&#x4E86;&#x5927;&#x91CF;&#x53CD;&#x9988;&#x4E0E;&#x5EFA;&#x8BAE;&#x540E;&#xFF0C;&#x6211;&#x5BF9;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x4E86;&#x91CD;&#x5927;&#x4FEE;&#x8BA2;&#xFF0C;&#x5E76;&#x8BA2;&#x6B63;&#x4E86;&#x62FC;&#x5199;&#x9519;&#x8BEF;&#x3002;</li>
</ul>
</li>
<li><p>0.99</p>
<ul>
<li>2004 &#x5E74; 2 &#x6708; 22 &#x65E5;</li>
<li>&#x6DFB;&#x52A0;&#x4E86;&#x6709;&#x5173;&#x6A21;&#x5757;&#x7684;&#x7AE0;&#x8282;&#xFF0C;&#x589E;&#x8865;&#x4E86;&#x6709;&#x5173;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x7684;&#x53D8;&#x91CF;&#x6570;&#x91CF;&#x7684;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x3002;</li>
</ul>
</li>
<li><p>0.98</p>
<ul>
<li>2004 &#x5E74; 2 &#x6708; 16 &#x65E5;</li>
<li>&#x7F16;&#x5199;&#x4E86;&#x4E00;&#x4E2A; Python &#x811A;&#x672C;&#x4E0E; CSS &#x6837;&#x5F0F;&#x8868;&#x6765;&#x6539;&#x5584; XHTML &#x8F93;&#x51FA;&#xFF0C;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5C1A;&#x663E;&#x7C97;&#x7CD9;&#x7684;&#x8BCD;&#x6CD5;&#x5206;&#x6790;&#x5668;&#xFF0C;&#x7528;&#x4EE5;&#x4E3A;&#x5217;&#x51FA;&#x7684;&#x7A0B;&#x5E8F;&#x81EA;&#x52A8;&#x8FDB;&#x884C; VIM &#x5F0F;&#x7684;&#x52A0;&#x4EAE;&#x3002;</li>
</ul>
</li>
<li><p>0.97</p>
<ul>
<li>2004 &#x5E74; 2 &#x6708; 13 &#x65E5;</li>
<li>&#x53C8;&#x4E00;&#x7248;&#x5B8C;&#x5168;&#x91CD;&#x5199;&#x540E;&#x7684;&#x65B0;&#x7248;&#xFF0C;&#xFF08;&#x518D;&#x6B21;&#xFF09;&#x91C7;&#x7528; DocBook XML&#x3002;&#x672C;&#x4E66;&#x5DF2;&#x6709;&#x5927;&#x91CF;&#x6539;&#x8FDB;&#x2014;&#x2014;&#x73B0;&#x5728;&#x66F4;&#x52A0;&#x8FDE;&#x8D2F;&#x4E14;&#x66F4;&#x52A0;&#x6613;&#x8BFB;&#x3002;</li>
</ul>
</li>
<li><p>0.93</p>
<ul>
<li>2004 &#x5E74; 1 &#x6708; 25 &#x65E5;</li>
<li>&#x589E;&#x52A0;&#x4E86; IDLE &#x8BA8;&#x8BBA;&#x4E0E;&#x66F4;&#x591A; Windows &#x76F8;&#x5173;&#x7684;&#x7279;&#x5B9A;&#x5185;&#x5BB9;&#x3002;</li>
</ul>
</li>
<li><p>0.92</p>
<ul>
<li>2004 &#x5E74; 1 &#x6708; 5 &#x65E5;</li>
<li>&#x4FEE;&#x6539;&#x4E86;&#x5C0F;&#x90E8;&#x5206;&#x6848;&#x4F8B;&#x3002;</li>
</ul>
</li>
<li><p>0.91</p>
<ul>
<li>2003 &#x5E74; 12 &#x6708; 30 &#x65E5;</li>
<li>&#x8BA2;&#x6B63;&#x8F93;&#x5165;&#x9519;&#x8BEF;&#x3002;&#x5BF9;&#x8BF8;&#x591A;&#x8BDD;&#x9898;&#x8FDB;&#x884C;&#x6539;&#x5584;&#x3002;</li>
</ul>
</li>
<li><p>0.90</p>
<ul>
<li>2003 &#x5E74; 12 &#x6708; 18 &#x65E5;</li>
<li>&#x65B0;&#x589E;&#x4E24;&#x7BC7;&#x7AE0;&#x8282;&#x3002;&#x91C7;&#x7528; <a href="https://en.wikipedia.org/wiki/OpenOffice" target="_blank">OpenOffice</a> &#x683C;&#x5F0F;&#x5E76;&#x8FDB;&#x884C;&#x4E86;&#x4FEE;&#x8BA2;&#x3002;</li>
</ul>
</li>
<li><p>0.60</p>
<ul>
<li>2003 &#x5E74; 11 &#x6708; 21 &#x65E5;</li>
<li>&#x5B8C;&#x5168;&#x91CD;&#x5199;&#x5E76;&#x6269;&#x5145;&#x5185;&#x5BB9;&#x3002;</li>
</ul>
</li>
<li><p>0.20</p>
<ul>
<li>2003 &#x5E74; 11 &#x6708; 20 &#x65E5;</li>
<li>&#x8BA2;&#x6B63;&#x67D0;&#x4E9B;&#x8F93;&#x5165;&#x9519;&#x8BEF;&#x5E76;&#x8FDB;&#x884C;&#x52D8;&#x8BEF;&#x3002;</li>
</ul>
</li>
<li><p>0.15</p>
<ul>
<li>2003 &#x5E74; 11 &#x6708; 20 &#x65E5;</li>
<li>&#x8FC1;&#x79FB;&#x81F3; <a href="https://en.wikipedia.org/wiki/DocBook" target="_blank">DocBook XML</a> &#x4E0E; XEmacs&#x3002;</li>
</ul>
</li>
<li><p>0.10</p>
<ul>
<li>2003 &#x5E74; 11 &#x6708; 14 &#x65E5;</li>
<li>&#x4F7F;&#x7528; <a href="https://en.wikipedia.org/wiki/Kword" target="_blank">KWord</a> &#x7684;&#x9996;&#x4EFD;&#x8349;&#x7A3F;&#x3002;</li>
</ul>
</li>
</ul>

        </div>
    
</div>

        
    </body>
</html>

