
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>附录：翻译</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    
        
        <link rel="stylesheet" href="gitbook/ebook.css">
        
    

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/ebook.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    </head>
    <body>
        
<div class="page">
    
        <h1 class="book-chapter book-chapter-1">附录：翻译</h1>
        <div class="section">
            <h1 id="&#x7FFB;&#x8BD1;">&#x7FFB;&#x8BD1;</h1>
<p>&#x672C;&#x4E66;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x4E0B;&#x9605;&#x8BFB;&#xFF0C;&#x611F;&#x8C22;&#x8FD9;&#x4E9B;&#x65E0;&#x79C1;&#x7684;&#x5FD7;&#x613F;&#x8005;&#x4EEC;&#xFF01;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x534F;&#x52A9;&#x8FD9;&#x4E9B;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x5148;&#x53C2;&#x9605;&#x4E0B;&#x65B9;&#x7684;&#x7FFB;&#x8BD1;&#x8BED;&#x8A00;&#x4E0E;&#x5FD7;&#x613F;&#x8005;&#x5217;&#x8868;&#xFF0C;&#x518D;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x8981;&#x5E2E;&#x52A9;&#x73B0;&#x6709;&#x7684;&#x7FFB;&#x8BD1;&#x9879;&#x76EE;&#xFF0C;&#x8FD8;&#x662F;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x7FFB;&#x8BD1;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8BA1;&#x5212;&#x5F00;&#x59CB;&#x4E00;&#x9879;&#x65B0;&#x7684;&#x7FFB;&#x8BD1;&#x9879;&#x76EE;&#xFF0C;&#x8BF7;&#x9605;&#x8BFB;<a href="24.translation_howto.md#translation-howto">&#x5982;&#x4F55;&#x7FFB;&#x8BD1;&#x672C;&#x4E66;</a>&#x3002;</p>
<h2 id="&#x963F;&#x62C9;&#x4F2F;&#x8BED;">&#x963F;&#x62C9;&#x4F2F;&#x8BED;</h2>
<p>&#x4E0B;&#x65B9;&#x63D0;&#x4F9B;&#x4E86;&#x672C;&#x4E66;&#x963F;&#x62C9;&#x4F2F;&#x8BED;&#x7248;&#x672C;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x611F;&#x8C22; Ashraf Ali Khalaf &#x7FFB;&#x8BD1;&#x4E86;&#x672C;&#x4E66;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728; <a href="http://www.khaledhosny.org/byte-of-python/index.html" target="_blank">http://www.khaledhosny.org/byte-of-python/index.html</a> &#x5728;&#x7EBF;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE; <a href="http://downloads.sourceforge.net/omlx/byteofpython_arabic.pdf?use_mirror=osdn" target="_blank">sourceforge.net</a> &#x4E0B;&#x8F7D;&#x672C;&#x4E66;&#xFF0C;&#x60F3;&#x8981;&#x4E86;&#x89E3;&#x5173;&#x4E8E;&#x672C;&#x8BD1;&#x672C;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; <a href="http://itwadi.com/byteofpython_arabi" target="_blank">http://itwadi.com/byteofpython_arabi</a>&#x3002;</p>
<h2 id="&#x963F;&#x585E;&#x62DC;&#x7586;&#x8BED;">&#x963F;&#x585E;&#x62DC;&#x7586;&#x8BED;</h2>
<p>Jahangir Shabiyev (c.shabiev@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x6210;&#x963F;&#x585E;&#x62DC;&#x7586;&#x8BED;&#x3002;&#x76EE;&#x524D;&#x7FFB;&#x8BD1;&#x9879;&#x76EE;&#x6B63;&#x5728; <a href="https://www.gitbook.com/book/jahangir-sh/piton-sancmasi" target="_blank">https://www.gitbook.com/book/jahangir-sh/piton-sancmasi</a> &#x63A8;&#x8FDB;&#x4E2D;&#x3002;</p>
<h2 id="&#x5DF4;&#x897F;&#x8461;&#x8404;&#x7259;&#x8BED;">&#x5DF4;&#x897F;&#x8461;&#x8404;&#x7259;&#x8BED;</h2>
<p>&#x672C;&#x4E66;&#x73B0;&#x5728;&#x6709;&#x4E24;&#x7248;&#x5DF4;&#x897F;&#x8461;&#x8404;&#x7259;&#x8BED;&#x8BD1;&#x672C;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x7FFB;&#x8BD1;&#x8FDB;&#x5EA6;&#x4E0E;&#x53EF;&#x9605;&#x89C8;&#x4E0E;&#x5426;&#x5404;&#x6709;&#x4E0D;&#x540C;&#x3002;&#x8001;&#x8BD1;&#x672C;&#x73B0;&#x5DF2;&#x6563;&#x4F5A;&#x9057;&#x5931;&#xFF0C;&#x65B0;&#x8BD1;&#x672C;&#x76EE;&#x524D;&#x5C1A;&#x672A;&#x5B8C;&#x6210;&#x3002;</p>
<p>Samuel Dias Neto (samuel.arataca@gmail.com) &#x7FFB;&#x8BD1;&#x4E86;&#x672C;&#x4E66;&#x7684;&#x7B2C;&#x4E00;&#x7248;&#x5DF4;&#x897F;&#x8461;&#x8404;&#x7259;&#x8BED;&#x8BD1;&#x672C;&#xFF08;&#x8001;&#x8BD1;&#x672C;&#xFF09;&#xFF0C;&#x5F53;&#x65F6; Python &#x8FD8;&#x505C;&#x7559;&#x5728; 2.3.5 &#x7248;&#x3002;&#x73B0;&#x5728;&#x5DF2;&#x627E;&#x4E0D;&#x5230;&#x672C;&#x8BD1;&#x672C;&#x7684;&#x4EFB;&#x4F55;&#x516C;&#x5F00;&#x7248;&#x672C;&#x3002;</p>
<p><a href="http://rodrigoamaral.net" target="_blank">Rodrigo Amaral</a> (rodrigoamaral@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x5DF4;&#x897F;&#x8461;&#x8404;&#x7259;&#x8BED;&#xFF08;&#x65B0;&#x8BD1;&#x672C;&#xFF09;&#xFF0C;&#x76EE;&#x524D;&#x672C;&#x8BD1;&#x672C;&#x8FD8;&#x672A;&#x5B8C;&#x6210;&#x3002;</p>
<h2 id="&#x52A0;&#x6CF0;&#x7F57;&#x5C3C;&#x4E9A;&#x8BED;">&#x52A0;&#x6CF0;&#x7F57;&#x5C3C;&#x4E9A;&#x8BED;</h2>
<p>Moises Gomez (moisesgomezgiron@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x52A0;&#x6CF0;&#x7F57;&#x5C3C;&#x4E9A;&#x8BED;&#x3002;&#x76EE;&#x524D;&#x7FFB;&#x8BD1;&#x4ECD;&#x5728;&#x8FDB;&#x884C;&#x4E2D;&#x3002;</p>
<blockquote>
<p>Mois&#xE8;s G&#xF3;mez - &#x6211;&#x662F;&#x4E00;&#x540D;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E00;&#x540D;&#x7F16;&#x7A0B;&#x6559;&#x5E08;&#xFF08;&#x901A;&#x5E38;&#x4E3A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x7684;&#x666E;&#x901A;&#x4EBA;&#x6559;&#x5B66;&#xFF09;</p>
<p>&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x524D;&#x6211;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x4F7F;&#x7528; Python &#x7F16;&#x7A0B;&#xFF0C;Swaroop &#x7684;&#x4F5C;&#x54C1;&#x771F;&#x7684;&#x975E;&#x5E38;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#xFF0C;&#x8DB3;&#x591F;&#x5B8C;&#x6574;&#x3002;&#x6B63;&#x662F;&#x6211;&#x6240;&#x9700;&#x8981;&#x7684;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x6B21;&#x7ECF;&#x5386;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x60F3;&#x5230;&#x5728;&#x6211;&#x7684;&#x56FD;&#x5BB6;&#x8FD8;&#x6709;&#x4E9B;&#x5176;&#x4ED6;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x4E2D;&#x6709;&#x6240;&#x6536;&#x83B7;&#xFF0C;&#x4F46;&#x82F1;&#x8BED;&#x53EF;&#x80FD;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x969C;&#x788D;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x8BD5;&#x7740;&#x628A;&#x5B83;&#x7FFB;&#x8BD1;&#x4E86;&#x5462;&#xFF1F;&#x4E8E;&#x662F;&#x6211;&#x4FBF;&#x7FFB;&#x8BD1;&#x4E86;&#x5148;&#x524D;&#x7248;&#x672C;&#x7684; BoP&#x3002;</p>
<p>&#x5728;&#x6211;&#x7684;&#x56FD;&#x5BB6;&#x6709;&#x7740;&#x4E24;&#x79CD;&#x5B98;&#x65B9;&#x8BED;&#x8A00;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x52A0;&#x6CF0;&#x7F57;&#x5C3C;&#x4E9A;&#x8BED;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x60F3;&#x7740;&#x4F1A;&#x6709;&#x4EBA;&#x628A;&#x5B83;&#x7FFB;&#x8BD1;&#x6210;&#x4F7F;&#x7528;&#x66F4;&#x4E3A;&#x5E7F;&#x6CDB;&#x7684;&#x897F;&#x73ED;&#x7259;&#x8BED;&#x3002;</p>
</blockquote>
<h2 id="&#x4E2D;&#x6587;">&#x4E2D;&#x6587;</h2>
<p>2005 &#x5E74;&#xFF0C;&#x6C88;&#x6D01;&#x5143;&#x5C06;&#x672C;&#x4E66; 1.20 &#x7248;&#x7FFB;&#x8BD1;&#x6210;&#x7B80;&#x4F53;&#x4E2D;&#x6587;&#xFF0C;&#x5E76;&#x53D1;&#x5E03;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x3002;&#x5728; BoP &#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x4E0A;&#xFF0C;&#x4ED6;&#x7559;&#x540D;&#x4E3A; Juan Shen&#xFF0C;&#x90AE;&#x7BB1;&#x5730;&#x5740;&#x4E3A; orion_val@163.com&#x3002;&#x8FD9;&#x4E00;&#x8BD1;&#x672C;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x5E7F;&#x4E3A;&#x6D41;&#x4F20;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5176;&#x6700;&#x521D;&#x7684;&#x51FA;&#x5904;&#x5DF2;&#x4E0D;&#x53EF;&#x8003;&#xFF0C;&#x539F;&#x5148;&#x63D0;&#x4F9B;&#x5728; BoP &#x5B98;&#x7F51;&#x4E0A;&#x7684;&#x94FE;&#x63A5;&#x4E5F;&#x5DF2;&#x7ECF;&#x5931;&#x6548;&#xFF0C;&#x56E0;&#x6B64;&#x6B64;&#x5904;&#x65E0;&#x6CD5;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x786E;&#x5207;&#x7684;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x201C;&#x7B80;&#x660E;Python&#x6559;&#x7A0B; &#x6C88;&#x6D01;&#x5143;&#x201D;&#x6216;&#x7C7B;&#x4F3C;&#x5173;&#x952E;&#x8BCD;&#x6765;&#x83B7;&#x5F97;&#x4E00;&#x4EFD;&#x526F;&#x672C;&#x3002;</p>
<p>2017 &#x5E74;&#xFF0C;&#x6F20;&#x4F26;&#xFF08;i@molun.net&#xFF09;&#x57FA;&#x4E8E;&#x539F;&#x4E66; 4.0 &#x7248;&#x91CD;&#x65B0;&#x7FFB;&#x8BD1;&#x51FA;&#x4E86;&#x65B0;&#x8BD1;&#x672C;&#xFF0C;&#x5E76;&#x6258;&#x7BA1;&#x4E8E; GitHub &#x4E0E; Gitbook&#x3002;&#x4ED6;&#x8FD8;&#x5728;&#x6301;&#x7EED;&#x8DDF;&#x8FDB;&#x8FD9;&#x4E00;&#x8BD1;&#x672C;&#xFF0C;&#x5E76;&#x4E0D;&#x65AD;&#x4FEE;&#x6B63;&#x8BD1;&#x672C;&#x4E2D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x4E0E;&#x758F;&#x6F0F;&#x3002;</p>
<p>2017 &#x7248;&#x8BD1;&#x672C;&#x53EF;&#x4EE5;&#x5728; <a href="https://bop.molun.net" target="_blank">https://bop.molun.net</a> &#x4E0A;&#x6D4F;&#x89C8;&#x5E76;&#x83B7;&#x5F97;&#x3002;</p>
<h2 id="&#x7E41;&#x4F53;&#x4E2D;&#x6587;">&#x7E41;&#x4F53;&#x4E2D;&#x6587;</h2>
<p>Fred Lin (gasolin@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x7E41;&#x4F53;&#x4E2D;&#x6587;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728; <a href="http://code.google.com/p/zhpy/wiki/ByteOfZhpy" target="_blank">http://code.google.com/p/zhpy/wiki/ByteOfZhpy</a> &#x627E;&#x5230;&#x8FD9;&#x672C;&#x4E66;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x8BD1;&#x672C;&#x7684;&#x4E00;&#x5927;&#x4EE4;&#x4EBA;&#x6FC0;&#x52A8;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x5176;&#x5305;&#x542B;&#x4E86;<em>&#x53EF;&#x6267;&#x884C;&#x7684;&#x4E2D;&#x6587; Python &#x6E90;&#x4EE3;&#x7801;</em> &#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x5305;&#x62EC;&#x4E86; Python &#x7684;&#x539F;&#x59CB;&#x6E90;&#x4EE3;&#x7801;&#x3002;</p>
<blockquote>
<p>Fred Lin - &#x6211;&#x662F;&#x4E00;&#x540D;&#x4F9B;&#x804C;&#x4E8E; Delta Network &#x7F51;&#x7EDC;&#x786C;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x8FD8;&#x662F;&#x4E00;&#x540D; TurboGears &#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x7684;&#x8D21;&#x732E;&#x8005;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x4F4D; Python &#x798F;&#x97F3;&#x4F20;&#x9053;&#x8005;(:-p)&#xFF0C;&#x6211;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x7D20;&#x6750;&#x6765;&#x63A8;&#x5E7F; Python &#x8BED;&#x8A00;&#x3002;&#x6211;&#x53D1;&#x73B0;&#x300A;&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#x300B;&#x65E0;&#x8BBA;&#x662F;&#x5BF9;&#x4E8E;&#x65B0;&#x624B;&#x8FD8;&#x662F;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x4E00;&#x9053;&#x7EDD;&#x4F73;&#x751C;&#x70B9;&#x3002;&#x300A;&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#x300B;&#x7528;&#x4E00;&#x4E2A;&#x53EF;&#x627F;&#x53D7;&#x7684;&#x7BC7;&#x5E45;&#x8BB2;&#x89E3;&#x4E86; Python &#x4E2D;&#x7684;&#x8981;&#x70B9;&#x6240;&#x5728;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x8BD1;&#x672C;&#x6700;&#x5F00;&#x59CB;&#x57FA;&#x4E8E;&#x7B80;&#x4F53;&#x4E2D;&#x6587;&#x8BD1;&#x672C;&#xFF0C;&#x5C14;&#x540E;&#x5F88;&#x5FEB;&#x5C31;&#x5386;&#x7ECF;&#x4E86;&#x5927;&#x91CF;&#x91CD;&#x5199;&#x4EE5;&#x9002;&#x5E94;&#x73B0;&#x5728;&#x7684;&#x7EF4;&#x57FA;&#x7248;&#x672C;&#x4EE5;&#x53CA;&#x9605;&#x8BFB;&#x8D28;&#x91CF;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7684;&#x7E41;&#x4F53;&#x4E2D;&#x6587;&#x7248;&#x672C;&#x8FD8;&#x5305;&#x62EC;&#x4E86;&#x4E00;&#x5957;&#x53EF;&#x6267;&#x884C;&#x7684;&#x4E2D;&#x6587; Python &#x6E90;&#x7801;&#xFF0C;&#x5B83;&#x6536;&#x5F55;&#x5728;&#x6211;&#x7684;&#x6211;&#x7684;&#x65B0;&#x9879;&#x76EE;&#x201C;zhpy&#x201D;&#xFF08;Python in Chinese&#xFF09;&#x4E2D;&#xFF08;&#x81EA; 8 &#x6708; 7 &#x65E5;&#x8D77;&#x8FD0;&#x884C;&#xFF09;&#x3002;</p>
<p>zhpy&#xFF08;&#x8BFB;&#x4F5C;Z.H.? &#x6216;&#x8005;&#x8BFB;&#x4F5C; zippy&#xFF09;&#x5728; Python &#x4E4B;&#x4E0A;&#x5EFA;&#x7ACB;&#x4E86;&#x65B0;&#x7684;&#x4E00;&#x5C42;&#x7528;&#x4EE5;&#x5C06; Python &#x7FFB;&#x8BD1;&#x81F3;&#x4E2D;&#x6587;&#x6216;&#x4F7F;&#x7528;&#x4E2D;&#x6587;&#x4EA4;&#x4E92;&#xFF08;&#x65E0;&#x8BBA;&#x662F;&#x7B80;&#x4F53;&#x8FD8;&#x662F;&#x7E41;&#x4F53;&#xFF09;&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x7528;&#x4E8E;&#x6559;&#x80B2;&#x7528;&#x9014;&#x3002;</p>
</blockquote>
<h2 id="&#x6CD5;&#x8BED;">&#x6CD5;&#x8BED;</h2>
<p>Gregory (coulix@ozforces.com.au) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x6CD5;&#x8BED;&#x3002;</p>
<p>G&#xE9;rard Labadie (gerard.labadie@gmail.com) &#x5B8C;&#x6210;&#x4E86;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x6CD5;&#x8BED;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="&#x5FB7;&#x8BED;">&#x5FB7;&#x8BED;</h2>
<p>Lutz Horn (lutz.horn@gmx.de)&#xFF0C; Bernd Hengelein (bernd.hengelein@gmail.com) &#x4E0E; Christoph Zwerschke (cito@online.de) &#x5171;&#x540C;&#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x5FB7;&#x8BED;&#x3002;</p>
<p>&#x4ED6;&#x4EEC;&#x7684;&#x8BD1;&#x672C;&#x73B0;&#x5728;&#x5B58;&#x50A8;&#x5728; <a href="http://ftp.jaist.ac.jp/pub//sourceforge/a/ab/abop-german.berlios/" target="_blank">http://ftp.jaist.ac.jp/pub//sourceforge/a/ab/abop-german.berlios/</a>&#x3002;</p>
<p>Lutz Horn &#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x6211;&#x4ECA;&#x5E74; 32 &#x5C81;&#xFF0C;&#x5728;&#x5FB7;&#x56FD;&#x6D77;&#x5FB7;&#x5C14;&#x5821;&#x5927;&#x5B66;&#x83B7;&#x5F97;&#x4E86;&#x6570;&#x5B66;&#x5B66;&#x4F4D;&#x3002;&#x76EE;&#x524D;&#x6211;&#x6B63;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x4F9B;&#x804C;&#x4E8E;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x8D44;&#x52A9;&#x9879;&#x76EE;&#xFF0C;&#x4E3A;&#x5FB7;&#x56FD;&#x6240;&#x6709;&#x4E0E;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x7269;&#x5EFA;&#x7ACB;&#x4E00;&#x5BB6;&#x95E8;&#x6237;&#x7F51;&#x7AD9;&#x3002;&#x5F53;&#x4E0B;&#x6211;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x4E3B;&#x8981;&#x8BED;&#x8A00;&#x662F; Java&#xFF0C;&#x4F46;&#x6211;&#x5E0C;&#x671B;&#x5728;&#x540E;&#x53F0;&#x80FD;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x4F7F;&#x7528; Python&#x3002;&#x7279;&#x522B;&#x662F;&#x6587;&#x672C;&#x5206;&#x6790;&#x4E0E;&#x8F6C;&#x6362;&#x8FD9;&#x7C7B;&#x5DE5;&#x4F5C;&#x80FD;&#x591F;&#x5F88;&#x5BB9;&#x6613;&#x7528; Python &#x5904;&#x7406;&#x3002;&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x6089; GUI &#x5DE5;&#x5177;&#x5305;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5927;&#x90E8;&#x5206;&#x7684;&#x7F16;&#x7A0B;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x4E0E; Web &#x5E94;&#x7528;&#x6709;&#x5173;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x5927;&#x90FD;&#x662F;&#x7531;&#x8BF8;&#x5982; Struts &#x8FD9;&#x4E9B; Java &#x6846;&#x67B6;&#x6784;&#x5EFA;&#x7684;&#x3002;&#x73B0;&#x5728;&#x6211;&#x6B63;&#x5C1D;&#x8BD5;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x5229;&#x7528; Python &#x548C;&#x5B83;&#x7684;&#x751F;&#x6210;&#x5668;&#x7684;&#x529F;&#x80FD;&#x6027;&#x7F16;&#x7A0B;&#x7279;&#x6027;&#x3002;&#x5728;&#x77ED;&#x6682;&#x63A5;&#x89E6;&#x8FC7; Ruby &#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5BF9;&#x8FD9;&#x4E00;&#x8BED;&#x8A00;&#x5BF9;&#x5757;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x6709;&#x7740;&#x6DF1;&#x523B;&#x5370;&#x8C61;&#x3002; &#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x559C;&#x6B22; Python &#x548C; Ruby &#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x7684;&#x52A8;&#x6001;&#x7279;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x6211;&#x505A;&#x66F4;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x5176;&#x4ED6;&#x66F4;&#x591A;&#x5982; Java &#x8FD9;&#x4E9B;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x4E2D;&#x6240;&#x4E0D;&#x80FD;&#x505A;&#x5230;&#x7684;&#x3002;&#x6211;&#x641C;&#x7D22;&#x4E86;&#x4E00;&#x4E9B;&#x6709;&#x5173;&#x7F16;&#x7A0B;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x90A3;&#x4E9B;&#x9002;&#x5408;&#x5411;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x4F20;&#x6388;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x6211;&#x66FE;&#x7ECF;&#x627E;&#x5230;&#x4E86;&#x540D;&#x4E3A;&#x300A;How to Think Like a Computer Scientist: Learning with Python&#x300B;&#x300A;Dive into Python&#x300B;&#x7684;&#x6559;&#x6750;&#xFF0C;&#x524D;&#x8005;&#x8DB3;&#x591F;&#x4F18;&#x79C0;&#x4F46;&#x5BF9;&#x4E8E;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#x800C;&#x8A00;&#x592A;&#x957F;&#x4E86;&#xFF0C;&#x540E;&#x8005;&#x5219;&#x4E0D;&#x592A;&#x9002;&#x5408;&#x65B0;&#x624B;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x300A;&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#x300B;&#x5728;&#x4E24;&#x8005;&#x95F4;&#x53D6;&#x5F97;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x5E73;&#x8861;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x65E2;&#x4E0D;&#x957F;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x4F20;&#x6388;&#x7ED9;&#x65B0;&#x624B;&#x65F6;&#x4E5F;&#x8DB3;&#x591F;&#x8BE6;&#x7EC6;&#x3002;&#x9664;&#x5F00;&#x8FD9;&#x4E9B;&#xFF0C;&#x6211;&#x559C;&#x6B22; DocBook &#x7684;&#x7B80;&#x5355;&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x591A;&#x79CD;&#x4E30;&#x5BCC;&#x683C;&#x5F0F;&#x4E3A;&#x7FFB;&#x8BD1;&#x6587;&#x672C;&#x63D0;&#x4F9B;&#x5BCC;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x8F93;&#x51FA;&#x751F;&#x6210;&#x3002;</p>
</blockquote>
<p>Bernd Hengelein &#x8BF4;&#xFF1A;</p>
<blockquote>
<p>Lutz &#x4E0E;&#x6211;&#x6B63;&#x51C6;&#x5907;&#x4E00;&#x540C;&#x8FDB;&#x884C;&#x5FB7;&#x8BED;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x5F00;&#x59CB;&#x7FFB;&#x8BD1;&#x4ECB;&#x7ECD;&#x4E0E;&#x5E8F;&#x8A00;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4F1A;&#x8BA9;&#x4F60;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x6240;&#x63A8;&#x8FDB;&#x7684;&#x4EFB;&#x4F55;&#x8FDB;&#x5C55;&#x3002;&#x597D;&#x7684;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x4E00;&#x4E9B;&#x6709;&#x5173;&#x4E8E;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x4ECA;&#x5E74;&#x5DF2; 34 &#x5C81;&#xFF0C;&#x81EA; 1980 &#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#x6211;&#x4E0E;&#x7535;&#x8111;&#x5171;&#x821E;&#x7684;&#x7684;&#x65F6;&#x95F4;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7; 20 &#x5E74;&#x4E86;&#xFF0C;&#x5F53;&#x65F6;&#x201C;Commodore 64&#x201D;&#x6B63;&#x7EDF;&#x6CBB;&#x7740;&#x6258;&#x513F;&#x6240;&#x3002;&#x5728;&#x5B66;&#x4E60;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x540E;&#x6211;&#x5F00;&#x59CB;&#x4EE5;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x8EAB;&#x4EFD;&#x53C2;&#x4E0E;&#x5DE5;&#x4F5C;&#x3002;&#x73B0;&#x5728;&#x6211;&#x5728;&#x4E00;&#x5BB6;&#x5FB7;&#x56FD;&#x5927;&#x578B;&#x516C;&#x53F8;&#x7684;&#x533B;&#x7597;&#x6210;&#x50CF;&#x9886;&#x57DF;&#x5DE5;&#x4F5C;&#x3002;&#x5C3D;&#x7BA1; C++ &#x662F;&#x6211;&#x4E3B;&#x8981;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4E5F;&#xFF08;&#x5FC5;&#x987B;&#xFF09;&#x4F7F;&#x7528;&#x5B83;&#x5C55;&#x5F00;&#x6BCF;&#x5929;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4ECD;&#x5728;&#x4E0D;&#x65AD;&#x5BFB;&#x627E;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x6765;&#x5B66;&#x4E60;&#x3002;&#x5C31;&#x5728;&#x53BB;&#x5E74;&#x6211;&#x7231;&#x4E0A;&#x4E86; Python&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5B83;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x8FD8;&#x662F;&#x5B83;&#x7684;&#x7F8E;&#x4E3D;&#x7686;&#x4EE4;&#x4EBA;&#x60CA;&#x53F9;&#x4E0D;&#x5DF2;&#x3002;&#x6211;&#x66FE;&#x5728;&#x7F51;&#x4E0A;&#x67D0;&#x5904;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x4EBA;&#x8BF4;&#x4ED6;&#x559C;&#x6B22; Python &#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x770B;&#x8D77;&#x6765;&#x662F;&#x5982;&#x6B64;&#x6F02;&#x4EAE;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x4ED6;&#x6240;&#x8BF4;&#x7684;&#x786E;&#x662F;&#x5982;&#x6B64;&#x3002;&#x81EA;&#x90A3;&#x65F6;&#x8D77;&#x6211;&#x4FBF;&#x51B3;&#x5B9A;&#x8981;&#x5B66;&#x4E60; Python&#xFF0C;&#x800C;&#x6211;&#x53D1;&#x73B0;&#x53EA;&#x6709;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x4F18;&#x79C0;&#x6587;&#x6863;&#x80FD;&#x5728;&#x5FB7;&#x8BED;&#x4E4B;&#x4E0B;&#x9605;&#x8BFB;&#x3002;&#x5F53;&#x6211;&#x5076;&#x7136;&#x9047;&#x5230;&#x4F60;&#x7684;&#x8FD9;&#x672C;&#x4E66;&#x65F6;&#xFF0C;&#x8981;&#x5C06;&#x5B83;&#x7FFB;&#x8BD1;&#x6210;&#x5FB7;&#x8BED;&#x7684;&#x60F3;&#x6CD5;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5730;&#x6A2A;&#x4E98;&#x5728;&#x6211;&#x7684;&#x5FC3;&#x95F4;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;Lutz &#x4E0E;&#x6211;&#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4E8E;&#x662F;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x5DE5;&#x800C;&#x52A8;&#x3002;&#x6211;&#x671F;&#x5F85;&#x7740;&#x6211;&#x548C; Lutz &#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x5408;&#x4F5C;&#xFF01;</p>
</blockquote>
<h2 id="&#x5E0C;&#x814A;&#x8BED;">&#x5E0C;&#x814A;&#x8BED;</h2>
<p>Ubuntu &#x5E0C;&#x814A;&#x793E;&#x533A; <a href="http://wiki.ubuntu-gr.org/byte-of-python-el" target="_blank">&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x5E0C;&#x814A;&#x8BED;</a>&#xFF0C;&#x8FD9;&#x4E00;&#x8BD1;&#x672C;&#x7528;&#x4E8E;&#x6211;&#x4EEC;&#x5728;&#x793E;&#x533A;&#x4E2D;&#x4E3E;&#x529E;&#x7684;&#x5728;&#x7EBF;&#x5F02;&#x6B65; Python &#x8BFE;&#x7A0B;&#x3002;&#x8054;&#x7CFB; <a href="https://twitter.com/savvasradevic" target="_blank">@savvasradevic</a> &#x4EE5;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="&#x5370;&#x5EA6;&#x5C3C;&#x897F;&#x4E9A;&#x8BED;">&#x5370;&#x5EA6;&#x5C3C;&#x897F;&#x4E9A;&#x8BED;</h2>
<p>Daniel (daniel.mirror@gmail.com) &#x6B63;&#x5728; <a href="http://python.or.id/moin.cgi/ByteofPython" target="_blank">http://python.or.id/moin.cgi/ByteofPython</a> &#x4E0A;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x5370;&#x5EA6;&#x5C3C;&#x897F;&#x4E9A;&#x8BED;&#x3002;</p>
<p>Wisnu Priyambodo (cibermen@gmail.com) &#x540C;&#x6837;&#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x5370;&#x5EA6;&#x5C3C;&#x897F;&#x4E9A;&#x8BED;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;Bagus Aji Santoso (baguzzzaji@gmail.com) &#x4E5F;&#x5FD7;&#x613F;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;&#x3002;</p>
<h2 id="&#x610F;&#x5927;&#x5229;&#x8BED;&#xFF08;&#x7B2C;&#x4E00;&#x7248;&#xFF09;">&#x610F;&#x5927;&#x5229;&#x8BED;&#xFF08;&#x7B2C;&#x4E00;&#x7248;&#xFF09;</h2>
<p>Enrico Morelli (mr.mlucci@gmail.com) &#x4E0E; Massimo Lucci (morelli@cerm.unifi.it) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x610F;&#x5927;&#x5229;&#x8BED;&#x3002;</p>
<p>&#x8BE5;&#x610F;&#x5927;&#x5229;&#x8BED;&#x8BD1;&#x672C;&#x73B0;&#x5728;&#x5B58;&#x653E;&#x5728; <a href="http://www.gentoo.it/Programmazione/byteofpython" target="_blank">http://www.gentoo.it/Programmazione/byteofpython</a>&#x3002;</p>
<blockquote>
<p><em>Massimo Lucci and Enrico Morelli</em> - &#x6211;&#x4EEC;&#x5C31;&#x804C;&#x4E8E;&#x4F5B;&#x7F57;&#x4F26;&#x8428;&#x5927;&#x5B66;&#xFF08;&#x610F;&#x5927;&#x5229;&#xFF09;&#x7684;&#x5316;&#x5B66;&#x7CFB;&#x3002;&#x6211;&#xFF08;Massimo&#xFF09;&#x62C5;&#x4EFB;&#x6838;&#x78C1;&#x5171;&#x632F;&#x5149;&#x8C31;&#x4EEA;&#x7684;&#x670D;&#x52A1;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0E;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#xFF1B;Enrico &#x5728;&#x6211;&#x4EEC;&#x7684; CED &#x4E0E;&#x5E76;&#x884C;/&#x96C6;&#x7FA4;&#x7CFB;&#x7EDF;&#x4E2D;&#x62C5;&#x4EFB;&#x670D;&#x52A1;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0E;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Python &#x7F16;&#x7A0B;&#x5DF2;&#x7ECF;&#x6709;&#x4E03;&#x5E74;&#x4E86;&#xFF0C;&#x5728; Linux &#x5E73;&#x53F0;&#x4E0A;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x4EA6;&#x6709;&#x5341;&#x5E74;&#x4E4B;&#x4E45;&#x3002;&#x5728;&#x610F;&#x5927;&#x5229;&#xFF0C;&#x6211;&#x4EEC;&#x8D1F;&#x8D23;&#x5E76;&#x7BA1;&#x7406;&#x4E0E; Gentoo/Linux &#x6709;&#x5173;&#x7684; www.gentoo.it &#x7F51;&#x7AD9;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x4E3A;&#x6838;&#x78C1;&#x5171;&#x632F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0E;&#x5927;&#x4F1A;&#x7EC4;&#x7EC7;&#x548C;&#x7BA1;&#x7406;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684; www.nmr.it &#x7F51;&#x7AD9;&#x7684;&#x8D21;&#x732E;&#x8005;&#xFF08;&#x7F51;&#x7AD9;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x5EFA;&#x8BBE;&#xFF09;&#x3002;&#x4E0E;&#x6211;&#x4EEC;&#x6709;&#x5173;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#xFF01;&#x6211;&#x4EEC;&#x5BF9;&#x4F60;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x53EA;&#x80FD;&#x8BED;&#x8A00;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#xFF0C;&#x5E76;&#x8BA4;&#x4E3A;&#x63A8;&#x8350; Python &#x7ED9;&#x65B0;&#x7684;&#x4F7F;&#x7528;&#x8005;&#xFF08;&#x6211;&#x4EEC;&#x6B63;&#x8003;&#x8651;&#x5411;&#x6211;&#x4EEC;&#x5B9E;&#x9A8C;&#x5BA4;&#x4E2D;&#x6570;&#x767E;&#x4F4D;&#x5B66;&#x751F;&#x4E0E;&#x7814;&#x7A76;&#x8005;&#x63A8;&#x8350;&#xFF09;&#x662F;&#x6781;&#x5177;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
</blockquote>
<h2 id="&#x610F;&#x5927;&#x5229;&#x8BED;&#xFF08;&#x7B2C;&#x4E8C;&#x7248;&#xFF09;">&#x610F;&#x5927;&#x5229;&#x8BED;&#xFF08;&#x7B2C;&#x4E8C;&#x7248;&#xFF09;</h2>
<p>&#x53E6;&#x4E00;&#x4EFD;&#x610F;&#x5927;&#x5229;&#x8BED;&#x8BD1;&#x672C;&#x7531; <a href="http://besthcgdropswebsite.com/translate" target="_blank">Calvina Bice</a> &#x4E0E;&#x5176;&#x540C;&#x4E8B;&#x4E8E; <a href="http://besthcgdropswebsite.com/translate/a-byte-of-python/" target="_blank">http://besthcgdropswebsite.com/translate/a-byte-of-python/</a> &#x7FFB;&#x8BD1;&#x3002;</p>
<h2 id="&#x65E5;&#x8BED;">&#x65E5;&#x8BED;</h2>
<p>Shunro Dozono (dozono@gmail.com) &#x6B63;&#x5728;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x65E5;&#x8BED;&#x3002;</p>
<h2 id="&#x97E9;&#x8BED;">&#x97E9;&#x8BED;</h2>
<p>Jeongbin Park (pjb7687@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x97E9;&#x8BED;&#xFF1A;<a href="https://github.com/pjb7687/byte_of_python" target="_blank">https://github.com/pjb7687/byte_of_python</a></p>
<blockquote>
<p>&#x6211;&#x662F; Jeongbin Park&#xFF0C;&#x73B0;&#x5728;&#x662F;&#x97E9;&#x56FD;&#x7684;&#x4E00;&#x540D;&#x751F;&#x7269;&#x7269;&#x7406;&#x4E0E;&#x751F;&#x7269;&#x4FE1;&#x606F;&#x5B66;&#x7814;&#x7A76;&#x5458;&#x3002;</p>
<p>&#x4E00;&#x5E74;&#x524D;&#xFF0C;&#x6211;&#x66FE;&#x5BFB;&#x627E;&#x4E00;&#x672C;&#x8DB3;&#x591F;&#x597D;&#x7684; Python &#x6559;&#x7A0B;&#x6765;&#x63A8;&#x8350;&#x7ED9;&#x6211;&#x7684;&#x540C;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x6211;&#x4EEC;&#x8FD9;&#x4E00;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x4E2D;&#x4F7F;&#x7528; Python &#x5DF2;&#x7ECF;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#xFF0C;&#x5B83;&#x7684;&#x7528;&#x6237;&#x57FA;&#x6570;&#x6B63;&#x4E0D;&#x65AD;&#x589E;&#x957F;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;&#x90A3;&#x65F6;&#x53EA;&#x6709;&#x5F88;&#x5C11;&#x7684; Python &#x56FE;&#x4E66;&#x62E5;&#x6709;&#x97E9;&#x8BED;&#x7248;&#x672C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x51B3;&#x5B9A;&#x7FFB;&#x8BD1;&#x4F60;&#x64B0;&#x5199;&#x7684;&#x8FD9;&#x672C;&#x7535;&#x5B50;&#x4E66;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x6211;&#x5EA6;&#x8FC7;&#x7684;&#x6700;&#x597D;&#x7684;&#x4E00;&#x672C; Python &#x6307;&#x5357;&#xFF01;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x5DF2;&#x7FFB;&#x8BD1;&#x5230;&#x97E9;&#x8BED;&#xFF0C;&#x8FD8;&#x5269;&#x4E0B;&#x4ECB;&#x7ECD;&#x7AE0;&#x8282;&#x548C;&#x9644;&#x5F55;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x518D;&#x6B21;&#x611F;&#x8C22;&#x4F60;&#x7F16;&#x5199;&#x51FA;&#x4E86;&#x8FD9;&#x672C;&#x5982;&#x6B64;&#x4F18;&#x79C0;&#x7684;&#x6307;&#x5357;&#xFF01;</p>
</blockquote>
<h2 id="&#x8499;&#x53E4;&#x8BED;">&#x8499;&#x53E4;&#x8BED;</h2>
<p>Ariunsanaa Tunjin (luftballons2010@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x8499;&#x53E4;&#x8BED;&#x3002;</p>
<p>2009 &#x5E74; 11 &#x6708; 9 &#x65E5;&#x66F4;&#x65B0;&#xFF1A;Ariunsanaa &#x73B0;&#x5728;&#x5DF2;&#x51E0;&#x4E4E;&#x5B8C;&#x6210;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="&#x632A;&#x5A01;&#x8BED;&#xFF08;&#x5DF4;&#x514B;&#x6469;&#x632A;&#x5A01;&#x8BED;&#xFF09;">&#x632A;&#x5A01;&#x8BED;&#xFF08;&#x5DF4;&#x514B;&#x6469;&#x632A;&#x5A01;&#x8BED;&#xFF09;</h2>
<p>Eirik V&#xE5;geskar &#x662F;&#x4E00;&#x540D;&#x5728;&#x632A;&#x5A01; <a href="http://no.wikipedia.org/wiki/Sandvika_videreg%C3%A5ende_skole" target="_blank">Sandvika videreg&#xE5;ende skole</a> &#x5C31;&#x8BFB;&#x7684;&#x4E00;&#x540D;&#x9AD8;&#x4E2D;&#x751F;&#xFF0C;&#x76EE;&#x524D;&#x4ED6;&#x6B63;&#x5728;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x632A;&#x5A01;&#x8BED;&#xFF08;&#x5DF4;&#x514B;&#x6469;&#x632A;&#x5A01;&#x8BED;&#xFF09;&#x3002;</p>
<blockquote>
<p><em>Eirik V&#xE5;geskar</em>: &#x6211;&#x4E00;&#x76F4;&#x90FD;&#x60F3;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x7684;&#x6BCD;&#x8BED;&#x5C5E;&#x4E8E;&#x5C0F;&#x8BED;&#x79CD;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E00;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x5341;&#x5206;&#x56F0;&#x96BE;&#x3002;&#x5927;&#x90E8;&#x5206;&#x6559;&#x7A0B;&#x4E0E;&#x6559;&#x6750;&#x4E66;&#x90FD;&#x91C7;&#x7528;&#x975E;&#x5E38;&#x4E13;&#x4E1A;&#x7684;&#x82F1;&#x8BED;&#x6765;&#x64B0;&#x5199;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x90E8;&#x5206;&#x9AD8;&#x4E2D;&#x6BD5;&#x4E1A;&#x751F;&#x90FD;&#x4E0D;&#x4F1A;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x8BCD;&#x6C47;&#x91CF;&#x6765;&#x7406;&#x89E3;&#x6559;&#x7A0B;&#x8BF4;&#x7684;&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x5F53;&#x6211;&#x53D1;&#x73B0;&#x8FD9;&#x672C;&#x4E66;&#x65F6;&#xFF0C;&#x6211;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#x90FD;&#x88AB;&#x89E3;&#x51B3;&#x4E86;&#x3002;&#x300A;&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#x300B;&#x7528;&#x7740;&#x7B80;&#x5355;&#x800C;&#x975E;&#x4E13;&#x4E1A;&#x6027;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x89E3;&#x91CA;&#x4E00;&#x79CD;&#x540C;&#x6837;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E8C;&#x8005;&#x4F7F;&#x5F97;&#x5B66;&#x4E60; Python &#x6210;&#x4E86;&#x4E00;&#x9879;&#x8DA3;&#x4E8B;&#x3002;&#x5728;&#x9605;&#x8BFB;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x4E00;&#x534A;&#x7BC7;&#x5E45;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x503C;&#x5F97;&#x53BB;&#x7FFB;&#x8BD1;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x7FFB;&#x8BD1;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x672C;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4E0E;&#x6211;&#x51FA;&#x4E8E;&#x76F8;&#x540C;&#x5883;&#x5730;&#x7684;&#x4EBA;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x5E74;&#x8F7B;&#x4EBA;&#xFF09;&#xFF0C;&#x4E5F;&#x6216;&#x8BB8;&#x80FD;&#x591F;&#x6709;&#x5229;&#x4E8E;&#x5728;&#x90A3;&#x4E9B;&#x53EA;&#x5177;&#x6709;&#x5C11;&#x6570;&#x6280;&#x672F;&#x77E5;&#x8BC6;&#x7684;&#x4EBA;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x5BF9;&#x8FD9;&#x4E00;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5174;&#x8DA3;&#x3002;</p>
</blockquote>
<h2 id="&#x6CE2;&#x5170;&#x8BED;">&#x6CE2;&#x5170;&#x8BED;</h2>
<p>Dominik Kozaczko (dominik@kozaczko.info) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x6CE2;&#x5170;&#x8BED;&#x3002;&#x8BE5;&#x8BD1;&#x672C;&#x7684;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#xFF0C;&#x5B83;&#x7684;&#x4E3B;&#x9875;&#x8BBE;&#x7F6E;&#x5728;&#x6B64;&#xFF1A;<a href="http://python.edu.pl/byteofpython/" target="_blank">Uk&#x105;&#x15B; Pythona</a>&#x3002;</p>
<p>&#x66F4;&#x65B0;&#xFF1A;&#x73B0;&#x5728;&#x672C;&#x8BD1;&#x672C;&#x5DF2;&#x7FFB;&#x8BD1;&#x5B8C;&#x6210;&#x5E76;&#x4E8E; 2009 &#x5E74; 10 &#x6708; 2 &#x65E5;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x3002;&#x611F;&#x8C22; Dominik&#x3001;&#x4ED6;&#x7684;&#x4E24;&#x4F4D;&#x5B66;&#x751F;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x611F;&#x8C22;&#x4ED6;&#x4EEC;&#x6240;&#x5949;&#x732E;&#x51FA;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x7CBE;&#x529B;&#xFF01;</p>
<blockquote>
<p><em>Dominik Kozaczko</em> - &#x6211;&#x662F;&#x4E00;&#x540D;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E0E;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x6559;&#x5E08;&#x3002;</p>
</blockquote>
<h2 id="&#x8461;&#x8404;&#x7259;&#x8BED;">&#x8461;&#x8404;&#x7259;&#x8BED;</h2>
<p>Fidel Viegas (fidel.viegas@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x8461;&#x8404;&#x7259;&#x8BED;&#x3002;</p>
<h2 id="&#x7F57;&#x9A6C;&#x5C3C;&#x4E9A;&#x8BED;">&#x7F57;&#x9A6C;&#x5C3C;&#x4E9A;&#x8BED;</h2>
<p>Paul-Sebastian Manole (brokenthorn@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x7F57;&#x9A6C;&#x5C3C;&#x4E9A;&#x8BED;&#x3002;</p>
<blockquote>
<p><em>Paul-Sebastian Manole</em> - &#x6211;&#x662F;&#x4E00;&#x540D;&#x5C31;&#x8BFB;&#x4E8E;&#x7F57;&#x9A6C;&#x5C3C;&#x4E9A; Spiru Haret &#x5927;&#x5B66;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E8C;&#x5E74;&#x7EA7;&#x5B66;&#x751F;&#x3002;&#x6211;&#x662F;&#x4E00;&#x540D;&#x81EA;&#x5B66;&#x7A0B;&#x5E8F;&#x5458;&#x5E76;&#x6B63;&#x51C6;&#x5907;&#x53BB;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#x2014;&#x2014;Python&#x3002;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x4FE1;&#x606F;&#x544A;&#x8BC9;&#x6211;&#x6CA1;&#x6709;&#x522B;&#x7684;&#x65B9;&#x5F0F;&#x6BD4;&#x9605;&#x8BFB;&#x300A;&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#x300B;&#x4F1A;&#x66F4;&#x597D;&#x4E86;&#x3002;&#x4F60;&#x4FBF;&#x53EF;&#x4EE5;&#x6599;&#x60F3;&#x8FD9;&#x672C;&#x4E66;&#x7A76;&#x7ADF;&#x6709;&#x591A;&#x6D41;&#x884C;&#xFF08;&#x795D;&#x8D3A;&#x4F5C;&#x8005;&#x80FD;&#x591F;&#x7F16;&#x5199;&#x51FA;&#x8FD9;&#x672C;&#x8FD9;&#x4E48;&#x5BB9;&#x6613;&#x5C31;&#x80FD;&#x8BFB;&#x61C2;&#x7684;&#x4E66;&#xFF09;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x559C;&#x6B22;&#x4E0A; Python&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x51B3;&#x5B9A;&#x534F;&#x52A9;&#x5C06; Swaroop &#x7684;&#x4E66;&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7FFB;&#x8BD1;&#x81F3;&#x7F57;&#x9A6C;&#x5C3C;&#x4E9A;&#x8BED;&#x3002;&#x5C3D;&#x7BA1;&#x6211;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x53D1;&#x8D77;&#x5021;&#x8BAE;&#x7684;&#x4EBA;&#xFF0C;&#x4F46;&#x6211;&#x4E5F;&#x4E0D;&#x8FC7;&#x662F;&#x4E00;&#x540D;&#x5FD7;&#x613F;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x610F;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#xFF0C;&#x8BF7;&#x52A0;&#x5165;&#x6211;&#x3002;</p>
</blockquote>
<h2 id="&#x4FC4;&#x8BED;">&#x4FC4;&#x8BED;</h2>
<p>Vladimir Smolyar (v_2e@ukr.net) &#x5728; <a href="http://wombat.org.ua/AByteOfPython/" target="_blank">http://wombat.org.ua/AByteOfPython/</a> &#x5B8C;&#x6210;&#x4E86;&#x672C;&#x4E66;&#x7684;&#x4FC4;&#x8BED;&#x7FFB;&#x8BD1;&#x3002;</p>
<h2 id="&#x4E4C;&#x514B;&#x5170;&#x8BED;">&#x4E4C;&#x514B;&#x5170;&#x8BED;</h2>
<p>Averkiev Andrey (averkiyev@ukr.net) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x4FC4;&#x8BED;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x4E4C;&#x514B;&#x5170;&#x8BED;&#xFF08;&#x5982;&#x679C;&#x65F6;&#x95F4;&#x5141;&#x8BB8;&#x7684;&#x8BDD;&#xFF09;&#x3002;</p>
<h2 id="&#x585E;&#x5C14;&#x7EF4;&#x4E9A;&#x8BED;">&#x585E;&#x5C14;&#x7EF4;&#x4E9A;&#x8BED;</h2>
<p>&quot;BugSpice&quot; (amortizerka@gmail.com) &#x5DF2;&#x5B8C;&#x6210;&#x4E86;&#x672C;&#x4E66;&#x7684;&#x585E;&#x5C14;&#x7EF4;&#x4E9A;&#x8BED;&#x8BD1;&#x672C;&#xFF1A;</p>
<blockquote>
<p>&#x6B64;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#x5DF2;&#x4E0D;&#x518D;&#x53EF;&#x7528;&#x3002;</p>
</blockquote>
<p>&#x6709;&#x5173;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF1A;<a href="http://forum.ubuntu-rs.org/Thread-zagrljaj-pitona" target="_blank">http://forum.ubuntu-rs.org/Thread-zagrljaj-pitona</a>&#x3002;</p>
<h2 id="&#x65AF;&#x6D1B;&#x4F10;&#x514B;&#x8BED;">&#x65AF;&#x6D1B;&#x4F10;&#x514B;&#x8BED;</h2>
<p>Albertio Ward (albertioward@gmail.com) &#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x65AF;&#x6D1B;&#x4F10;&#x514B;&#x8BED;&#xFF1A;<a href="http://www.fatcow.com/edu/python-swaroopch-sl/" target="_blank">http://www.fatcow.com/edu/python-swaroopch-sl/</a>&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4EEC;&#x662F;&#x975E;&#x76C8;&#x5229;&#x7EC4;&#x7EC7;&#x201C;&#x6559;&#x80B2;&#x7FFB;&#x8BD1;&#xFF08;Translation for education&#xFF09;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x7740;&#x4E00;&#x7FA4;&#x6210;&#x5458;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x6765;&#x81EA; Slavonic &#x5927;&#x5B66;&#x7684;&#x5B66;&#x751F;&#x4E0E;&#x6559;&#x6388;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x9662;&#x7CFB;&#x7684;&#x5B66;&#x751F;&#xFF1A;&#x8BED;&#x8A00;&#x5B66;&#x3001;&#x5316;&#x5B66;&#x3001;&#x751F;&#x7269;&#x5B66;&#x7B49;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x53D1;&#x73B0;&#x6709;&#x8DA3;&#x4E14;&#x53EF;&#x80FD;&#x4E0E;&#x6211;&#x4EEC;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x7684;&#x540C;&#x4E8B;&#x6709;&#x5173;&#x7684;&#x7684;&#x51FA;&#x7248;&#x7269;&#x3002;&#x6709;&#x65F6;&#x6211;&#x4EEC;&#x4F1A;&#x81EA;&#x5DF1;&#x53BB;&#x53D1;&#x73B0;&#x6587;&#x7AE0;&#xFF1B;&#x5176;&#x4ED6;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7684;&#x6559;&#x6388;&#x4F1A;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x7528;&#x4EE5;&#x7FFB;&#x8BD1;&#x7684;&#x6750;&#x6599;&#x3002;&#x5728;&#x83B7;&#x5F97;&#x4E86;&#x4F5C;&#x8005;&#x7684;&#x8BB8;&#x53EF;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x7FFB;&#x8BD1;&#x8FD9;&#x4E9B;&#x6587;&#x7AE0;&#x5E76;&#x5C06;&#x5176;&#x5F20;&#x8D34;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x535A;&#x5BA2;&#x4E4B;&#x4E0A;&#xFF0C;&#x4F9B;&#x6211;&#x4EEC;&#x7684;&#x540C;&#x4E8B;&#x4E8E;&#x670B;&#x53CB;&#x6D4F;&#x89C8;&#x3002;&#x8FD9;&#x4E9B;&#x7FFB;&#x8BD1;&#x540E;&#x7684;&#x51FA;&#x7248;&#x7269;&#x7ECF;&#x5E38;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x5B66;&#x751F;&#x7684;&#x65E5;&#x5E38;&#x5B66;&#x4E60;&#x751F;&#x6D3B;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#x3002;</p>
</blockquote>
<h2 id="&#x897F;&#x73ED;&#x7259;&#x8BED;">&#x897F;&#x73ED;&#x7259;&#x8BED;</h2>
<p>Alfonso de la Guarda Reyes (alfonsodg@ictechperu.net)&#xFF0C; Gustavo Echeverria (gustavo.echeverria@gmail.com)&#xFF0C; David Crespo Arroyo (davidcrespoarroyo@hotmail.com) &#x8FD8;&#x6709; Cristian Bermudez Serna (crisbermud@hotmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x897F;&#x73ED;&#x7259;&#x8BED;&#x3002;</p>
<p>Gustavo Echeverria &#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x6211;&#x5728;&#x963F;&#x6839;&#x5EF7;&#x62C5;&#x4EFB;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x6211;&#x901A;&#x5E38;&#x4F7F;&#x7528; C# &#x4E0E; .Net &#x6280;&#x672F;&#xFF0C;&#x4F46;&#x5728;&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6211;&#x575A;&#x5B88;&#x7740;&#x4F7F;&#x7528; Python &#x548C; Ruby&#x3002;&#x6211;&#x5728;&#x5F88;&#x591A;&#x5E74;&#x524D;&#x4E86;&#x89E3;&#x5230; Python &#x5E76;&#x4E14;&#x5F88;&#x5FEB;&#x4FBF;&#x7231;&#x4E0A;&#x4E86;&#x5B83;&#x3002;&#x5728;&#x6211;&#x63A5;&#x89E6; Python &#x6CA1;&#x591A;&#x4E45;&#x540E;&#x6211;&#x4FBF;&#x53D1;&#x73B0;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x662F;&#x5B83;&#x5E2E;&#x52A9;&#x6211;&#x5B66;&#x4E60;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x3002;&#x7136;&#x540E;&#x6211;&#x4FBF;&#x5FD7;&#x613F;&#x5C06;&#x8FD9;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x897F;&#x73ED;&#x7259;&#x8BED;&#x3002;&#x5728;&#x63A5;&#x5230;&#x4E86;&#x6570;&#x4E2A;&#x8BF7;&#x6C42;&#x4E4B;&#x540E;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x5F00;&#x59CB;&#x5728; Maximiliano Soler &#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x7FFB;&#x8BD1;&#x300A;A Byte of Python&#x300B;&#x3002;</p>
</blockquote>
<p>Cristian Bermudez Serna &#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x6211;&#x662F;&#x54E5;&#x4F26;&#x6BD5;&#x4E1A;&#x5B89;&#x8482;&#x5965;&#x57FA;&#x4E9A;&#x5927;&#x5B66;&#x7684;&#x7535;&#x4FE1;&#x5DE5;&#x7A0B;&#x4E13;&#x4E1A;&#x7684;&#x5B66;&#x751F;&#x3002;&#x51E0;&#x4E2A;&#x6708;&#x524D;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x5B66;&#x4E60; Python &#x7F16;&#x7A0B;&#x5E76;&#x53D1;&#x73B0;&#x4E86;&#x8FD9;&#x672C;&#x7F8E;&#x5999;&#x7684;&#x6559;&#x6750;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x51B3;&#x5B9A;&#x5FD7;&#x613F;&#x52A0;&#x5165;&#x897F;&#x73ED;&#x7259;&#x8BED;&#x7FFB;&#x8BD1;&#x3002;</p>
</blockquote>
<h2 id="&#x745E;&#x5178;&#x8BED;">&#x745E;&#x5178;&#x8BED;</h2>
<p>Mikael Jacobsson (leochingkwake@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x745E;&#x5178;&#x8BED;&#x3002;</p>
<h2 id="&#x571F;&#x8033;&#x5176;&#x8BED;">&#x571F;&#x8033;&#x5176;&#x8BED;</h2>
<p>T&#xFC;rker SEZER (tsezer@btturk.net) &#x4E0E; Bugra Cakir (bugracakir@gmail.com) &#x5FD7;&#x613F;&#x5C06;&#x672C;&#x4E66;&#x7FFB;&#x8BD1;&#x81F3;&#x571F;&#x8033;&#x5176;&#x8BED;&#x3002;</p>
<p>&quot;Where is Turkish version? Bitse de okusak.&quot;</p>

        </div>
    
</div>

        
    </body>
</html>

