
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>序言</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    
        
        <link rel="stylesheet" href="gitbook/ebook.css">
        
    

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/ebook.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    </head>
    <body>
        
<div class="page">
    
        <h1 class="book-chapter book-chapter-1">序言</h1>
        <div class="section">
            <h1 id="a-byte-of-python-bnu">a-byte-of-python-bnu</h1>
<h1 id="&#x7B80;&#x660E;-python-&#x6559;&#x7A0B;&#xFF08;&#x5317;&#x5E08;&#x5927;&#x5929;&#x6587;&#x7CFB;&#x7248;&#xFF09;">&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#xFF08;&#x5317;&#x5E08;&#x5927;&#x5929;&#x6587;&#x7CFB;&#x7248;&#xFF09;</h1>
<p>&#x672C;&#x4E66;&#x662F;&#x5317;&#x4EAC;&#x5E08;&#x8303;&#x5927;&#x5B66;&#x5929;&#x6587;&#x7CFB;&#x7684;&#x201C;Python&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x201D;&#x8BFE;&#x7A0B;&#x6559;&#x6750;&#xFF0C;&#x4E3A;&#x4F4E;&#x5E74;&#x7EA7;&#x672C;&#x79D1;&#x751F;&#x4ECB;&#x7ECD;&#x811A;&#x672C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;Python 3 &#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7F16;&#x7A0B;&#x57FA;&#x7840;&#x7684;&#x8BFB;&#x8005;&#x3002;&#x672C;&#x4E66;&#x662F;&#x5728; <strong>Swaroop C H</strong>&#x6240;&#x521B;&#x4F5C;&#x7684;&#x300A;&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#x300B;&#xFF08;Byte of Python&#xFF09;&#x4E00;&#x4E66;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x4FEE;&#x8BA2;&#x800C;&#x6765;&#x3002;
&#x300A;&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#x300B;&#x662F;&#x7531; <strong>Swaroop C H</strong> &#x7F16;&#x5199;&#xFF0C;&#x65E8;&#x5728;&#x4ECB;&#x7ECD; Python &#x8BED;&#x8A00;&#x7684;&#x81EA;&#x7531;&#x56FE;&#x4E66;&#x3002;2005 &#x5E74;&#xFF0C;<strong>&#x6C88;&#x6D01;&#x5143;</strong>&#x5C06;&#x672C;&#x4E66;&#x7684; 1.20 &#x7248;&#x5F15;&#x8FDB;&#x4E2D;&#x56FD;&#xFF0C;&#x5E76;&#x5B8C;&#x6210;&#x4E86;&#x5168;&#x672C;&#x7FFB;&#x8BD1;&#xFF0C;&#x5C06;&#x672C;&#x4E66;&#x7684;&#x8BD1;&#x540D;&#x5B9A;&#x4E3A;&#x300A;&#x7B80;&#x660E; Python &#x6559;&#x7A0B;&#x300B;&#x3002;
2017&#x5E74;&#xFF0C;<strong>&#x6F20;&#x4F26;</strong>&#x57FA;&#x4E8E;&#x539F;&#x4E66; 4.0 &#x7248;&#x91CD;&#x65B0;&#x7FFB;&#x8BD1;&#xFF0C;&#x5E76;&#x6CBF;&#x7528;&#x540C;&#x6837;&#x7684;&#x8BD1;&#x540D;&#x3002;&#x672C;&#x4E66;&#x662F;&#x5728;&#x5176; 2018 &#x5E74; 2 &#x6708; 4 &#x65E5; 4.08c &#x7248;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x548C;&#x4FEE;&#x6539;&#x3002;</p>
<h2 id="&#x8BB8;&#x53EF;&#x8BC1;">&#x8BB8;&#x53EF;&#x8BC1;</h2>
<p>&#x300A;Byte of Python&#x300B;&#x91C7;&#x7528; <a href="http://creativecommons.org/licenses/by-sa/4.0/" target="_blank">&#x77E5;&#x8BC6;&#x5171;&#x4EAB; &#x7F72;&#x540D;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB; &#x56FD;&#x9645; 4.0 &#x534F;&#x8BAE;&#xFF08;CC BY-SA Intl. 4.0&#xFF09;</a> &#x8FDB;&#x884C;&#x6388;&#x6743;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x539F;&#x4E66;&#x7684;<a href="https://python.swaroopch.com/" target="_blank">&#x5B98;&#x65B9;&#x7F51;&#x7AD9;</a>&#x4E0A;&#x83B7;&#x53D6;&#x672C;&#x4E66;&#x7684;&#x5168;&#x90E8;&#x539F;&#x59CB;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x672C;&#x8BD1;&#x672C;&#x4F9D;&#x636E;&#x76F8;&#x5173;&#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x7FFB;&#x8BD1;&#x4E0E;&#x518D;&#x5206;&#x53D1;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x672C;&#x8BD1;&#x672C;&#x7684;&#x6587;&#x672C;&#x5185;&#x5BB9;&#xFF0C;&#x91C7;&#x7528; <a href="http://creativecommons.org/licenses/by-sa/4.0/" target="_blank">&#x77E5;&#x8BC6;&#x5171;&#x4EAB; &#x7F72;&#x540D;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB; &#x56FD;&#x9645; 4.0 &#x534F;&#x8BAE;&#xFF08;CC BY-SA Intl. 4.0&#xFF09;</a> &#x8FDB;&#x884C;&#x6388;&#x6743;&#x3002;
&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#xFF1A;</p>
<ul>
<li><strong>&#x5206;&#x4EAB;</strong> - &#x5728;&#x4EFB;&#x4F55;&#x5A92;&#x4ECB;&#x6216;&#x683C;&#x5F0F;&#x4E0B;&#x590D;&#x5236;&#x5E76;&#x5206;&#x53D1;&#x672C;&#x4E66;&#x3002;&#x5982;&#x8F6C;&#x8F7D;&#x81F3;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x6216;&#x5C06;&#x5176;&#x5370;&#x5237;&#x540E;&#x5206;&#x53D1;&#x3002;</li>
<li><strong>&#x6539;&#x7F16;</strong> - &#x5BF9;&#x672C;&#x4E66;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3001;&#x91CD;&#x6DF7;&#x3001;&#x8F6C;&#x6362;&#x6216;&#x4F9D;&#x636E;&#x672C;&#x4E66;&#x8FDB;&#x884C;&#x518D;&#x521B;&#x4F5C;&#x3002;&#x5982;&#x5BF9;&#x672C;&#x8BD1;&#x672C;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x6216;&#x7F16;&#x8F91;&#xFF0C;&#x5E76;&#x91CD;&#x65B0;&#x53D1;&#x5E03;&#x3002;</li>
</ul>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4E8E;&#x4EFB;&#x4F55;&#x76EE;&#x7684;&#x6216;&#x73AF;&#x5883;&#x4F7F;&#x7528;&#x672C;&#x521B;&#x4F5C;&#xFF0C;&#x5373;&#x4F7F;&#x8FD0;&#x7528;&#x4E8E;&#x5546;&#x4E1A;&#x6027;&#x7528;&#x9014;&#x3002;
&#x552F;&#x987B;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#xFF1A;</p>
<ul>
<li><strong>&#x7F72;&#x540D;</strong> - &#x4F60;&#x5FC5;&#x987B;&#x660E;&#x786E;&#x8BF4;&#x660E;&#x672C;&#x521B;&#x4F5C;&#x3001;&#x6216;&#x7ECF;&#x8FC7;&#x4FEE;&#x6539;&#x7684;&#x539F;&#x521B;&#x4F5C;&#x6765;&#x6E90;&#x4E8E;&#x4F55;&#x5904;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x539F;&#x59CB;&#x94FE;&#x63A5;&#x4EE5;&#x53CA;&#x6388;&#x6743;&#x534F;&#x8BAE;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x9664;&#x975E;&#x53E6;&#x6709;&#x8BB8;&#x53EF;&#xFF0C;&#x4F60;&#x4E0D;&#x5F97;&#x660E;&#x793A;&#x6216;&#x6697;&#x793A;&#x4F60;&#x7684;&#x4F7F;&#x7528;&#x884C;&#x4E3A;&#x6216;&#x5546;&#x4E1A;&#x884C;&#x4E3A;&#xFF0C;&#x6765;&#x81EA;&#x4E8E;&#x521B;&#x4F5C;&#x7684;&#x539F;&#x4F5C;&#x8005;&#x7684;&#x6388;&#x610F;&#x6216;&#x6388;&#x6743;&#xFF0C;&#x6216;&#x5DF2;&#x4E3A;&#x4F60;&#x7684;&#x4F7F;&#x7528;&#x884C;&#x4E3A;&#x80CC;&#x4E66;&#x3002;</li>
<li><strong>&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5171;&#x4EAB;</strong> - &#x5982;&#x679C;&#x4F60;&#x5BF9;&#x672C;&#x4E66;&#x8FDB;&#x884C;&#x4E86;&#x4FEE;&#x6539;&#x3001;&#x91CD;&#x6DF7;&#x3001;&#x8F6C;&#x6362;&#xFF0C;&#x6216;&#x4F9D;&#x636E;&#x672C;&#x7D20;&#x6750;&#x8FDB;&#x884C;&#x518D;&#x521B;&#x4F5C;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x91C7;&#x7528;&#x4E0E;&#x672C;&#x4E66;&#x76F8;&#x540C;&#x7684;&#x8BB8;&#x53EF;&#x534F;&#x8BAE;&#x6765;&#x5206;&#x53D1;&#x4F60;&#x7684;&#x521B;&#x4F5C;&#x3002;</li>
<li><strong>&#x4E0D;&#x5F97;&#x589E;&#x52A0;&#x989D;&#x5916;&#x9650;&#x5236;</strong> - &#x4F60;&#x4E0D;&#x80FD;&#x589E;&#x8BBE;&#x4EFB;&#x4F55;&#x6CD5;&#x5F8B;&#x9650;&#x5236;&#x6216;&#x662F;&#x6280;&#x672F;&#x9650;&#x5236;&#xFF0C;&#x6765;&#x9650;&#x5236;&#x4ED6;&#x4EBA;&#x8FDB;&#x884C;&#x672C;&#x8BB8;&#x53EF;&#x8BC1;&#x5DF2;&#x7ECF;&#x5141;&#x8BB8;&#x7684;&#x884C;&#x4E3A;&#x3002;</li>
</ul>
<p>&#x53E6;&#x8BF7;&#x6CE8;&#x610F;&#xFF1A;</p>
<ul>
<li>&#x8BF7; <em>&#x4E0D;&#x8981;</em> &#x9500;&#x552E;&#x672C;&#x4E66;&#x7684;&#x7535;&#x5B50;&#x6216;&#x5370;&#x5237;&#x62F7;&#x8D1D;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x660E;&#x786E;&#x58F0;&#x660E;&#x8FD9;&#x4E9B;&#x62F7;&#x8D1D;&#x526F;&#x672C;&#x5E76; <em>&#x975E;</em> &#x6765;&#x81EA;&#x672C;&#x4E66;&#x7684;&#x539F;&#x4F5C;&#x8005;&#x3002;</li>
<li>&#x5728;&#x5206;&#x53D1;&#x65F6; <em>&#x52A1;&#x5FC5;</em> &#x5728;&#x6587;&#x6863;&#x7684;&#x4ECB;&#x7ECD;&#x6027;&#x63CF;&#x8FF0;&#x6216;&#x524D;&#x9875;&#x3001;&#x5934;&#x7248;&#x4E2D;&#x63D0;&#x4F9B;&#x56DE;&#x6EAF;&#x81F3;&#x672C;&#x4E66;&#x539F;&#x4E66; <a href="http://python.swaroopch.com/" target="_blank">http://python.swaroopch.com/</a> &#x4EE5;&#x53CA;&#x672C;&#x8BD1;&#x672C; <a href="https://bop.mol.uno" target="_blank">https://bop.mol.uno</a> &#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x5E76;&#x660E;&#x786E;&#x6307;&#x51FA;&#x672C;&#x4E66;&#x4E4B;&#x539F;&#x6587;&#x4E0E;&#x8BD1;&#x672C;&#x53EF;&#x5728;&#x4E0A;&#x8FF0;&#x94FE;&#x63A5;&#x5904;&#x83B7;&#x53D6;&#x3002;</li>
<li>&#x9664;&#x975E;&#x53E6;&#x6709;&#x58F0;&#x660E;&#xFF0C;&#x672C;&#x4E66;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x4E0E;&#x811A;&#x672C;&#x5747;&#x91C7;&#x7528; <a href="http://www.opensource.org/licenses/bsd-license.php" target="_blank">3-clause BSD License</a> &#x8FDB;&#x884C;&#x6388;&#x6743;&#x3002;</li>
</ul>
<h2 id="&#x73B0;&#x5728;&#x5C31;&#x5F00;&#x59CB;&#x9605;&#x8BFB;">&#x73B0;&#x5728;&#x5C31;&#x5F00;&#x59CB;&#x9605;&#x8BFB;</h2>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <a href="http://python.swaroopch.com/" target="_blank">http://python.swaroopch.com/</a> &#x5728;&#x7EBF;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x82F1;&#x6587;&#x539F;&#x7248;&#x3002;</p>
<p>&#x672C;&#x4E2D;&#x6587;&#x8BD1;&#x7248;&#x53EF;&#x901A;&#x8FC7; <a href="https://bop.mol.uno" target="_blank">https://bop.mol.uno</a> &#x5728;&#x7EBF;&#x9605;&#x8BFB;&#x3002;</p>
<h2 id="&#x8D2D;&#x4E70;&#x672C;&#x4E66;">&#x8D2D;&#x4E70;&#x672C;&#x4E66;</h2>
<p>&#x672C;&#x4E66;&#x82F1;&#x6587;&#x539F;&#x7248;&#x7684;&#x5370;&#x5237;&#x786C;&#x62F7;&#x8D1D;&#x53EF;&#x5728; <a href="http://www.swaroopch.com/buybook/" target="_blank">http://www.swaroopch.com/buybook/</a> &#x8D2D;&#x5F97;&#xFF0C;&#x7528;&#x4EE5;&#x83B7;&#x5F97;&#x79BB;&#x7EBF;&#x9605;&#x8BFB;&#x4F53;&#x9A8C;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x5411;&#x672C;&#x4E66;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#x4EE5;&#x63A8;&#x8FDB;&#x540E;&#x7EED;&#x7684;&#x5F00;&#x53D1;&#x4E0E;&#x6539;&#x8FDB;&#x3002;</p>
<p>&#x672C;&#x4E2D;&#x6587;&#x8BD1;&#x7248;<strong>&#x6CA1;&#x6709;</strong>&#x53D1;&#x884C;&#x6216;&#x8BB8;&#x53EF;&#x53D1;&#x884C;&#x4EFB;&#x4F55;&#x5370;&#x5237;&#x786C;&#x62F7;&#x8D1D;&#x3002;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x5546;&#x4E1A;&#x6216;&#x975E;&#x5546;&#x4E1A;&#x7EC4;&#x7EC7;&#x53EF;&#x4EE5;&#x5728;&#x9075;&#x5B88;&#x6388;&#x6743;&#x534F;&#x8BAE;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x81EA;&#x884C;&#x5370;&#x5237;&#x5E76;&#x53D1;&#x884C;&#x672C;&#x4E66;&#x7684;&#x786C;&#x62F7;&#x8D1D;&#xFF0C;&#x8FD9;&#x4E9B;&#x884C;&#x4E3A;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5F97;&#x5230;&#x539F;&#x4F5C;&#x8005;&#x548C;&#x8BD1;&#x8005;&#x7684;&#x8BB8;&#x53EF;&#x3002;&#x8BD1;&#x8005;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5370;&#x5237;&#x6216;&#x53D1;&#x884C;&#x884C;&#x4E3A;&#x83B7;&#x76CA;&#xFF0C;&#x4EA6;&#x4E0D;&#x5BF9;&#x8FD9;&#x4E9B;&#x672A;&#x7ECF;&#x4E13;&#x95E8;&#x6388;&#x6743;&#x7684;&#x5370;&#x5237;&#x6216;&#x786C;&#x62F7;&#x8D1D;&#x7248;&#x672C;&#x7684;&#x51C6;&#x786E;&#x6027;&#x8D1F;&#x8D23;&#x3002;</p>
<h2 id="&#x4E0B;&#x8F7D;">&#x4E0B;&#x8F7D;</h2>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; <a href="https://www.gitbook.com/book/lenkimo/byte-of-python-chinese-edition/" target="_blank">https://www.gitbook.com/book/lenkimo/byte-of-python-chinese-edition/</a> &#x4EE5;&#x83B7;&#x5F97;&#x672C;&#x4E66;&#x4EE5;&#x4E0B;&#x683C;&#x5F0F;&#x7684;&#x4E0B;&#x8F7D;&#xFF1A;</p>
<ul>
<li><a href="https://www.gitbook.com/download/pdf/book/lenkimo/byte-of-python-chinese-edition" target="_blank">PDF &#xFF08;&#x53EF;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x9605;&#x8BFB;&#xFF09;</a></li>
<li><a href="https://www.gitbook.com/download/epub/book/lenkimo/byte-of-python-chinese-edition" target="_blank">EPUB &#xFF08;&#x53EF;&#x5728; iPhone&#x3001;iPad&#x3001;&#x7535;&#x5B50;&#x4E66;&#x9605;&#x8BFB;&#x5668;&#x4E0A;&#x9605;&#x8BFB;&#xFF09;</a></li>
<li><a href="https://www.gitbook.com/download/mobi/book/lenkimo/byte-of-python-chinese-edition" target="_blank">Mobi &#xFF08;&#x53EF;&#x5728; Kindle &#x4E0A;&#x9605;&#x8BFB;&#xFF09;</a></li>
</ul>
<p>&#x4E0A;&#x8FF0;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#x7531; GitBook &#x63D0;&#x4F9B;&#x3002;&#x672C;&#x4E66;&#x5728;&#x672A;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E9B;&#x8BB8;&#x4FEE;&#x8BA2;&#xFF0C;GitBook &#x5C06;&#x5728;&#x4FEE;&#x8BA2;&#x63D0;&#x4EA4;&#x540E;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x6700;&#x65B0;&#x7248;&#x672C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6253;&#x7B97;&#x4E0B;&#x8F7D;&#x4E00;&#x4EFD;&#x7535;&#x5B50;&#x4E66;&#x7248;&#x7528;&#x6765;&#x79BB;&#x7EBF;&#x9605;&#x8BFB;&#xFF0C;&#x5EFA;&#x8BAE;&#x9694;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x56DE;&#x6765;&#x770B;&#x770B;&#x662F;&#x5426;&#x6709;&#x65B0;&#x7248;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x91C7;&#x7528; Markdown &#x8FDB;&#x884C;&#x5199;&#x4F5C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; <a href="https://github.com/LenKiMo/byte-of-python" target="_blank">https://github.com/LenKiMo/byte-of-python</a> &#x4EE5;&#x83B7;&#x5F97;&#x672C;&#x4E66;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x5185;&#x5BB9;&#xFF08;&#x7528;&#x4EE5;&#x63D0;&#x4EA4;&#x5EFA;&#x8BAE;&#x3001;&#x66F4;&#x6B63;&#x6216;&#x8FDB;&#x884C;&#x91CD;&#x53D1;&#x5E03;&#xFF09;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x82F1;&#x6587;&#x539F;&#x7248;&#x53EF;&#x4EE5;&#x5728; <a href="http://python.swaroopch.com/" target="_blank">http://python.swaroopch.com/</a> &#x5728;&#x7EBF;&#x6D4F;&#x89C8;&#xFF0C;&#x5176;&#x6E90;&#x4EE3;&#x7801;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x5728; <a href="https://github.com/swaroopch/byte-of-python" target="_blank">https://github.com/swaroopch/byte-of-python</a> &#x83B7;&#x5F97;&#x3002;</p>

        </div>
    
</div>

        
    </body>
</html>

